[
    "How many vocalists are there?",
    "What's the count of all the singers?",
    "Show the name, country, and age of all singers sorted from the oldest to the youngest.",
    "What are the names, countries, and ages for all of the singers, listed by decreasing age?",
    "What are the mean, minimum, and maximum ages of every French singer?",
    "What are the average, minimum, and maximum ages of all French vocalists?",
    "Show me the name and release year of the song by the youngest vocalist.",
    "What are the titles and years of release for every song by the most youthful vocalist?",
    "What are the different countries where singers older than 20 years of age hail from?",
    "What countries have singers older than 20?",
    "Show me the number of singers in each country that participated in the concert.",
    "How many vocalists come from every country?",
    "List all song titles by vocalists over the mean age.",
    "What are all the names of songs sung by artists who are above the normal age range?",
    "Show me the name and location of all stadiums with a capacity between 5000 and 10000.",
    "What are the places and titles of every station that has a capacity ranging from 5000 to 10000?",
    "What are the capacities and averages of all the stadiums?",
    "What is the maximum and average capacity of every stadium?",
    "What is the title and size of the stadium with the highest average attendance?",
    "What's the name and capacity of the stadium with the highest average attendance?",
    "How many gigs were held in 2014 or 2015?",
    "How many shows took place in either 2014 or 2015?",
    "Show me the stadium name and the number of concerts that have been held at each stadium.",
    "For every venue, what is the number of concerts that are held there?",
    "What is the name of the stadium with the highest capacity and the most number of concerts in 2014 or later?",
    "What's the name and capacity of the stadium that has held the most concerts since 2013?",
    "Which year had the highest number of concerts?",
    "What year had the largest number of concerts?",
    "Show me the names of the stadiums that have not hosted any concerts.",
    "What are the names of the arenas with no concerts?",
    "Show me the countries from which a singer above the age of 40 and a singer under the age of 30 come from.",
    "Show me the names of all the stadiums that don't have a concert in 2014.",
    "What are the titles of every stadium that didn't have a music event in 2014?",
    "Show me the theme and name of each concert, along with the number of singers performing in them.",
    "What are the titles, themes, and number of vocalists for each performance?",
    "List the names of the singers and the number of concerts for each singer?",
    "What are the singers' names and the number of shows they have performed in?",
    "List all names of the singers who performed in concerts in the year 2014.",
    "What are the appellations of the vocalists who gave a performance in a musical event in the year 2014?",
    "What is the name and country of the artist who has a song with the word 'Hey' in its title?",
    "What are the names and countries of origin of all the singers who have a song with the word 'Hey' in the title?",
    "Find the location and name of the stadiums where concerts took place in both 2014 and 2015.",
    "What are the locations and names of the stadiums that held concerts in both 2014 and 2015?",
    "What is the count of concerts held in the stadium with the largest capacity?",
    "What's the count of concerts that took place in the stadium with the highest capacity?",
    "What is the count of pets weighing more than 10?",
    "How many pets weigh more than 10?",
    "What is the weight of the youngest dog?",
    "How heavy is the youngest pup?",
    "What is the maximum weight for each type of pet? Please list the pet type and its corresponding maximum weight.",
    "What are the different types of pets and their maximum weight?",
    "Find out how many pets are owned by students over the age of 20.",
    "How many pets do students over the age of 20 have?",
    "Find the count of female students who raise dogs as pets.",
    "How many dogs do female students raise?",
    "What is the count of different kinds of pets?",
    "How many different categories of animal do we have as pets?",
    "Find the first name of students who own a cat or a dog.",
    "What are the given names of all students who own either a cat or a dog?",
    "Find the first name of students who have both feline and canine pets.",
    "What are the first names of the students who have both cats and dogs as pets?",
    "Find the age and major of students who do not own a feline.",
    "What is the major of all students who do not have a cat as a pet and what is their age?",
    "Find the ID of students who do not own a feline pet.",
    "What are the student IDs of those who do not possess cats as pets?",
    "Find the age and first name of students who own dogs but do not possess cats as their pets.",
    "What is the initial name of each student who possesses a canine but lacks a feline?",
    "What is the type and weight of the baby pet?",
    "What is the type of the youngest pet and what is its weight?",
    "Find all the pets older than 1 year of age and return their id and weight.",
    "What are the identification number and weight of each animal that is more than one year old?",
    "Find the maximum and average age of each type of pet.",
    "What are the mean and highest ages for each type of pet?",
    "What is the average weight for each type of pet?",
    "What is the weight average for each kind of pet?",
    "Find the age and first name of students who possess a pet.",
    "What are the ages and first names of students who possess pets?",
    "Find the pet id owned by student with the last name 'Smith'.",
    "What is the pet id owned by the student with the last name 'Smith'?",
    "Find out the number of pets for each student who owns a pet along with their student id.",
    "For pupils who possess animals, how many pets does each student have? List their IDs instead of names.",
    "Find students with multiple pets and their corresponding gender and first name.",
    "What are the first names and genders of all students who have more than one pet?",
    "What is the last name of the student who owns a 3-year-old cat?",
    "What's the surname of the student who owns a 3-year-old cat?",
    "Find the mean age of students who do not possess any pet.",
    "What is the mean age of all students who do not possess any pets?",
    "How many continents exist?",
    "What's the count of the total number of continents?",
    "How many countries are there in each continent? Please provide me with the continent id, continent name, and the number of countries.",
    "For every continent, provide its id, name, and the number of countries it contains?",
    "How many nations are there?",
    "How many nations are there?",
    "How many vehicles does each auto manufacturer produce? Please provide the full name, ID, and quantity for each maker.",
    "What is the name of each car manufacturer, along with its ID and the number of models it makes?",
    "What is the car model with the least amount of horsepower?",
    "What is the make and model of the car with the least amount of horsepower?",
    "What is the model of the car that has weight lower than the average weight?",
    "What model does the car which has weight less than the average have?",
    "Find out the names of car makers that manufactured some cars in the year 1970.",
    "What are the car manufacturers that made a car in the year 1970?",
    "What are the car makes and production years of the cars produced in the earliest year?",
    "What's the name of the manufacturer of the car produced in the earliest year and in which year was it produced?",
    "Which car models produced after 1980 are unique?",
    "What are the various models for the cards produced after 1980?",
    "How many car manufacturers are present in each continent and what is their count? List the names of the continents.",
    "What are the names of all the continents and how many car makers are there in each of them?",
    "Which country has the highest number of car manufacturers? Please provide the name of the country.",
    "What country has the most automobile manufacturers?",
    "How many car models does each manufacturer produce? Please provide the number of models and the full name of the manufacturer.",
    "What are the names of all the car makers and how many models are produced by each one?",
    "What is the acceleration of the AMC Hornet Sportabout (sw) car?",
    "How fast does the amc hornet sportabout (sw) accelerate?",
    "How many car manufacturers are located in France?",
    "What is the count of car manufacturers in France?",
    "How many car models are made in the US?",
    "What is the number of car models made in the US?",
    "What is the mpg of 4 cylinder cars on average?",
    "What's the mean gas mileage for all 4-cylinder cars?",
    "What is the minimum weight of a car with 8 cylinders produced in 1974?",
    "What's the minimum weight for a car with 8 cylinders that was made in 1974?",
    "What are all the manufacturers and their respective models?",
    "What car makers and models are there?",
    "What countries have at least one car manufacturer? List their names and IDs.",
    "What are the names and ids of all countries with at least one manufacturer of cars?",
    "What is the count of cars having horsepower greater than 150?",
    "What's the count of cars having horsepower above 150?",
    "What is the weight of cars on average per year?",
    "What is the weight average and year of each year?",
    "Which European countries have a minimum of 3 car manufacturers?",
    "What are the titles of every European country that has a minimum of 3 manufacturers?",
    "What is the make of the car models with 3 cylinders that have the highest horsepower?",
    "What is the make of the model with the highest horsepower amongst the models with 3 cylinders?",
    "Which automobile model is the most fuel-efficient, i.e., has the highest miles per gallon?",
    "What car model has the best mpg rating?",
    "What would be the average horsepower of the vehicles manufactured prior to 1980?",
    "What's the mean horsepower of cars made prior to 1980?",
    "What is the average edispl of the Volvo model vehicles?",
    "What is the mean edispl of all volvo vehicles?",
    "What's the highest acceleration for various cylinder counts?",
    "What is the top speed for each cylinder type?",
    "Which car manufacturer has produced the highest number of car models?",
    "What model has the largest number of versions?",
    "How many vehicles possess over four cylinders?",
    "What is the count of cars that have over 4 cylinders?",
    "How many vehicles were manufactured in the year 1980?",
    "In the year 1980, what was the number of cars produced?",
    "How many vehicle models were made by the manufacturer named American Motor Company?",
    "What is the count of car models produced by American Motor Company?",
    "Which car makers have created more than three car models? Please provide their full names and IDs.",
    "What makers have more than 3 models and what are their names and ids?",
    "Which unique models are made by manufacturer named General Motors or have weight greater than 3500?",
    "What are the various models produced by General Motors or had a weight exceeding 3500?",
    "In what years were cars manufactured with a weight between 3000 and 4000?",
    "What years were cars produced that had a weight less than 4000 and also cars that had a weight greater than 3000?",
    "What is the horsepower of the car with the fastest acceleration?",
    "What is the horsepower of the vehicle with the highest acceleration?",
    "For the Volvo model, what is the number of cylinders in the car with the slowest acceleration?",
    "For the volvo model, what is the number of cylinders in the version with the slowest acceleration?",
    "How many vehicles possess a greater acceleration than the automobile with the most horsepower?",
    "What's the count of cars that have a higher acceleration than the one with the greatest horsepower?",
    "How many countries have over two car manufacturers?",
    "What is the count of countries having over 2 car manufacturers?",
    "How many automobiles possess more than 6 cylinders?",
    "What's the count of cars with more than 6 cylinders?",
    "For the 4-cylinder cars, what is the model with the highest horsepower?",
    "Which model has the highest horsepower among the cars with 4 cylinders?",
    "Among cars with horsepower greater than the lowest, which cars have less than or equal to 3 cylinders? List the makeid and make name of the cars.",
    "What are the make ids and names of cars with less than 4 cylinders that do not have the minimum horsepower?",
    "What is the highest fuel efficiency of a car with 8 cylinders or made prior to 1980?",
    "What's the highest MPG of cars manufactured before 1980 or with 8 cylinders?",
    "Which car models weigh less than 3500 but are not manufactured by the 'Ford Motor Company'?",
    "What are the models that weigh less than 3500 and were not manufactured by Ford?",
    "What countries do not have any automobile manufacturers?",
    "What are some countries that don't have any car manufacturers?",
    "Which car manufacturers produce at least two models and have more than three car makers? Please provide their ID and maker.",
    "What are the IDs and manufacturers of all car manufacturers that manufacture at least two models and manufacture more than three cars?",
    "What countries have more than 3 car makers or produce the 'fiat' model?",
    "What countries have more than 3 car manufacturers or produce the Fiat model?",
    "To which country does the airline \"JetBlue Airways\" belong?",
    "What is the country of affiliation for Jetblue Airways?",
    "What's the short form for \"JetBlue Airways\"?",
    "What is the abbreviation of Jetblue Airways?",
    "List all airline names and their abbreviations in the \"USA\".",
    "What are the names and abbreviations of airlines operating in the United States?",
    "What are the airport names and codes for the city of Anthony?",
    "What is the airport code and name for the city of Anthony?",
    "How many airline companies are there?",
    "What is the total count of airlines?",
    "How many airports are there?",
    "What is the count of airports?",
    "How many flights are available?",
    "Return me the count of flights.",
    "Which airline has the abbreviation 'UAL'?",
    "Give me the name of the airline with the abbreviation 'UAL'.",
    "How many airlines are from the United States of America?",
    "How many airlines are there in the United States?",
    "What is the location of Alton airport in terms of city and country?",
    "What is the city and country of Alton airport?",
    "What is the name of the airport with code 'AKO'?",
    "What is the airport name for code 'AKO'?",
    "What are the names of airports in Aberdeen?",
    "What are the names of Aberdeen's airports?",
    "How many flights leave from 'APG'?",
    "How many flights leave from 'APG'?",
    "How many flights are going to ATO?",
    "Count how many flights arrived at ATO?",
    "How many flights leave from Aberdeen City?",
    "How many flights leave Aberdeen?",
    "How many flights come to Aberdeen city?",
    "How many flights are arriving in Aberdeen?",
    "How many flights leave Aberdeen and fly to Ashley?",
    "How many flights depart from Aberdeen and arrive at Ashley?",
    "How many flights does JetBlue Airways operate?",
    "Give me the total number of Jetblue Airways flights.",
    "How many flights from 'United Airlines' arrive at the airport 'ASY'?",
    "How many flights from United Airlines arrive at ASY Airport?",
    "How many flights from 'United Airlines' depart from Airport 'AHD'?",
    "How many flights are there from AHD Airport operated by United Airlines?",
    "How many flights from United Airlines arrive at Aberdeen?",
    "How many flights by United Airlines arrive at Aberdeen?",
    "Which city receives the highest number of incoming flights?",
    "Which city has the airport to which most flights are flown?",
    "Which city has the highest number of departing flights?",
    "Which airport is the most common departure point?",
    "What is the airport code with the most flights?",
    "What is the airport code for the airport with the highest number of flights?",
    "What is the airport code of the airport with the least number of flights?",
    "What is the airport code of the airport with the fewest flights?",
    "Which airline operates the largest number of flights?",
    "What is the airline that operates the largest number of flights?",
    "What is the abbreviation and country of the airline with the least number of flights?",
    "What's the airline with the least number of flights and which country does it belong to?",
    "What airlines have flights departing from AHD airport?",
    "Which airlines fly from AHD?",
    "What airlines have flights arriving at AHD airport?",
    "Which airlines offer flights to AHD airport?",
    "Find all airlines that operate flights from both airports 'APG' and 'CVO'.",
    "Which airlines have flights departing from both APG and CVO airports?",
    "Find all airlines that operate flights from airport 'CVO' but not from 'APG'.",
    "Which airlines depart from CVO but do not have flights from APG airports?",
    "Find all airlines that have a minimum of 10 flights.",
    "Which airlines operate at least 10 flights?",
    "Can you provide some more information on the desired writing style change? For example, should I change the sentence structure, use synonyms, or change the tone of the question?",
    "Which airlines operate fewer than 200 flights?",
    "What are the flight numbers for United Airlines?",
    "Which flight numbers correspond to United Airlines flights?",
    "What are the flight numbers of flights that depart from Airport \"APG\"?",
    "Give me the flight numbers of flights departing from APG.",
    "What are the flight numbers for flights arriving at \"APG\" airport?",
    "Give me the flight numbers of flights that will arrive at APG.",
    "What are the flight numbers of flights leaving from Aberdeen?",
    "What are the flight numbers of flights departing from Aberdeen?",
    "What are the flight numbers of flights arriving at Aberdeen?",
    "Give me the flight numbers of the flights that will be arriving in Aberdeen.",
    "How many flights are arriving at Aberdeen or Abilene?",
    "How many flights arrive at Aberdeen or Abilene?",
    "Find airports with no incoming or outgoing flights.",
    "Which airports do not have departing or arriving flights?",
    "How many workers are there?",
    "How many employees are there?",
    "Sort the age of employees in ascending order based on their name.",
    "What are the names of the employees and how are they sorted by age in ascending order?",
    "What is the total count of employees by city?",
    "How many employees are there in each city?",
    "Which cities are home to multiple employees under the age of 30?",
    "Find the cities with more than one employee aged below 30.",
    "Find out how many shops are there in each location.",
    "How many stores are located in each area?",
    "What is the name of the manager and district of the store with the highest number of products?",
    "What is the district and name of the manager of the store that sells the most products?",
    "Find the minimum and maximum number of products available in all stores.",
    "What is the range of products available in all shops?",
    "Return the name, district, and location of all shops in descending order of the number of products they have.",
    "Sort all of the stores by the number of products in descending order and provide the name, location, and district of each store.",
    "What are the names of stores that have more products than the average number of products?",
    "Which shops have more products than the average? Please provide the names of the shops.",
    "What is the name of the employee who has received the highest number of evaluations?",
    "Which worker was awarded the highest number of awards during evaluations? Please provide me with the name of the employee.",
    "What is the name of the employee who received the largest one-time bonus?",
    "What is the name of the employee who received the largest bonus?",
    "Find out the names of workers who haven't received any awards during their evaluation.",
    "What are the names of the workers who have not received any evaluations?",
    "What's the name of the store that's hiring the most employees?",
    "Which store has the highest number of employees? Please provide the store name.",
    "What are the names of the shops that do not employ any staff?",
    "Which shops operate without any staff members?",
    "Find out the number of employees recruited in each shop; display the name of the shop too.",
    "For every store, give the name of the store and the number of workers employed there.",
    "What is the total amount of bonuses awarded in all evaluations?",
    "Find the total bonus amount awarded in all evaluations.",
    "Give me all the details regarding employment.",
    "What are the details regarding the recruitment process?",
    "Which district contains stores having less than 3000 products and stores having more than 10000 products?",
    "What are the districts that have shops selling less than 3000 products and shops selling more than 10000 products?",
    "How many store locations are there in total?",
    "What is the count of unique shop locations?",
    "How many documents are there?",
    "What is the total count of documents?",
    "What are the document IDs, document names, and document descriptions for all documents?",
    "What are all the document IDs, names, and descriptions?",
    "What is the name of the document and its template ID for the document that has the letter 'w' in its description?",
    "Return the names and template ids for documents that have the letter w in their description.",
    "What are the document ID, template ID, and description for the document named \"Robbin CV\"?",
    "How about this: Could you please retrieve the document id, template id, and description for the document named Robbin CV from the database?",
    "How many templates are used across all documents?",
    "What is the count of unique document templates being utilized?",
    "How many documents utilize the template with type code 'PPT'?",
    "What is the count of documents that utilize the PPT template?",
    "Show me all the template ids and the number of documents that use each template.",
    "What are the various template IDs utilized for documents, and how frequently were they each utilized?",
    "What is the type code and id for the template that is utilized by the majority of the documents?",
    "Which template's id and type code are used for the largest number of documents?",
    "Show me the ids for all templates that are being used by more than one document.",
    "What are the IDs of the templates that have been used in more than one document?",
    "Show me the ids for templates that are not being used by any document.",
    "What are the template ids that are not being used in any documents?",
    "How many templates are available?",
    "What is the count of templates available?",
    "Show me all the template IDs, version numbers, and template type codes for every template.",
    "What are the IDs, versions, and type codes for every template?",
    "Show me all the unique template type codes for every template.",
    "What are the various codes for template types?",
    "What are the template ids for templates with template type PP or PPT?",
    "Return the ids of templates that contain the code PPT or PP.",
    "How many CV templates are there?",
    "What is the count of CV templates?",
    "What are the version number and template type code for the template with a version number greater than 5?",
    "Return me the template type codes and version numbers of templates with a version number above 5.",
    "Show me all the codes for template types and the count of templates for each one.",
    "What is the count of templates for each template type code?",
    "What is the template type code with the highest number of templates?",
    "What is the type code of the template type with the highest number of templates?",
    "Show me all template type codes that have fewer than three templates.",
    "What are the codes of template categories that have less than 3 templates?",
    "What is the template type code and version number of the smallest available version?",
    "Return me the template type code of the lowest version number available.",
    "What is the template type code of the template used by the document named \"Data base\"?",
    "What is the template type code of the template used by a document called Data base?",
    "Show me all the document names that use templates with template type code BK.",
    "What are the titles of documents that use templates with the code BK?",
    "Show me the count of documents for each type of template code.",
    "What are the various codes for the types of templates, and how many documents use each type?",
    "What is the most commonly used template type code for documents in the database?",
    "What is the code of the template type that is used most frequently in documents?",
    "Show me all the template types that are not used by any document.",
    "What are the codes of unused template types?",
    "Show me all the codes and descriptions for the different types of templates available.",
    "What are all the different code types and their descriptions for the various templates available?",
    "What are the descriptions for the AD template type?",
    "What is the description of the template type with code AD?",
    "What is the code for the template type of the description \"Book\"?",
    "What is the type code for the template type with the description \"Book\"?",
    "What are the different types of template descriptions for the templates that have been used in any document?",
    "What are the various descriptions for templates that have been utilized in a document?",
    "What template ids belong to the template type \"Presentation\"?",
    "What are the ids of the templates that have the description 'Presentation'?",
    "How many total paragraphs are there?",
    "What is the count of paragraphs?",
    "How many paragraphs are there in the document named 'Summer Show'?",
    "What is the total count of paragraphs in the document named 'Summer Show'?",
    "What are the paragraph details for the paragraph that contains the text 'Korea'?",
    "What are the specifics for the paragraph that contains the phrase 'Korea '?",
    "Show me all the paragraph ids and texts for the document named 'Welcome to New York'.",
    "What are the paragraph IDs and texts for the document named 'Welcome to NY'?",
    "Show me all the text for the document \"Customer reviews\".",
    "What is the paragraph text for the document named 'Customer Reviews'?",
    "Show me the document ids and the number of paragraphs in each document. Order them by document id.",
    "Can you provide me with an example of the writing style you would like me to use for generating the perturbed question?",
    "Show me the document ids, names and the number of paragraphs in each document.",
    "What are the document ids and names and how many paragraphs are there in each one?",
    "What are all the document ids that have at least two paragraphs?",
    "What are the document IDs that contain two or more paragraphs?",
    "What is the ID and name of the document with the highest number of paragraphs?",
    "What is the document ID and name of the document with the highest number of paragraphs?",
    "What is the ID of the document with the smallest number of paragraphs?",
    "What is the ID of the document with the smallest number of paragraphs?",
    "What's the ID of the document that has one to two paragraphs?",
    "Give me the ids of documents that contain a paragraph or two.",
    "Show me the document id that contains paragraphs with the text 'Brazil' and 'Ireland'.",
    "What are the document ids that contain the text 'Brazil' and 'Ireland'?",
    "How many educators are there?",
    "What is the aggregate number of instructors?",
    "What is the order of teachers' names according to their age?",
    "What are the names of the instructors sorted by increasing age?",
    "What is the hometown and age of instructors?",
    "What are the hometowns and ages of all teachers?",
    "List teachers who are not from the ``Little Lever Urban District``.",
    "What are the names of the instructors who don't come from the \"Little Lever Urban District\"?",
    "Show the names of instructors who are either 32 or 33 years old?",
    "What are the names of the instructors who are either 32 or 33 years old?",
    "What is the birthplace of the youngest instructor?",
    "Where does the youngest instructor hail from?",
    "Show the number of teachers from each hometown and the different hometown of teachers.",
    "For every place of origin, how many educators are present?",
    "List the hometowns of the majority of teachers.",
    "What are the hometowns of the majority of teachers?",
    "Show me the cities where more than one teacher is from.",
    "What are the places from which a minimum of two teachers originate?",
    "Show the courses arranged for each teacher and their respective names.",
    "What are the names of the teachers and the courses they teach?",
    "Show the courses that are to be taught by teachers in alphabetical order of the course name along with the names of the teachers.",
    "What are the titles of the instructors and the courses they instruct in ascending alphabetical order by the title of the instructor?",
    "Show me the math teacher's name.",
    "What are the titles of the individuals who instruct math classes?",
    "Show the number of courses each teacher teaches and their names.",
    "What are the titles of the instructors and how many classes do they instruct?",
    "Show me the names of instructors who teach more than one course.",
    "What are the names of instructors who teach two or more courses?",
    "List the names of instructors who have not been assigned to teach any courses.",
    "What are the titles of the educators whose courses have not been scheduled?",
    "How many visitors under the age of 30 are present?",
    "What are the names of the visitors with a membership level greater than 4, sorted by the level in descending order?",
    "What is the mean age of the people whose level of membership is less than or equal to 4?",
    "Find the names and membership levels of the visitors with a membership level greater than 4, and sort them by age from oldest to youngest.",
    "What is the museum with the highest number of employees, and what is its name?",
    "Find the average staff count for museums that opened prior to 2009.",
    "What is the year of establishment and number of personnel at Plaza Museum?",
    "Find the names of museums that have a higher number of staff than the minimum staff number of all museums that opened after 2010.",
    "Find the ID, name, and age of visitors who have visited museums more than once.",
    "What is the membership level, name, and ID of visitors who have spent the highest total amount of money on museum tickets?",
    "What is the name and id of the museum that has been visited the most?",
    "What's the name of the museum that hasn't had any visitors yet?",
    "What is the name and age of the visitor who made the largest purchase of tickets in one go?",
    "What is the mean and maximum number of tickets purchased during all museum visits?",
    "What is the total cost of tickets for visitors with membership level 1?",
    "What's the name of the visitor who visited both a museum that opened before 2009 and a museum that opened after 2011?",
    "Find out how many visitors did not visit any museum that was opened after 2010.",
    "How many museums were opened post 2013 or pre 2008?",
    "What is the count of players?",
    "How many athletes are there?",
    "What is the count of all the matches?",
    "Count how many matches have been played.",
    "List all the players from USA with their first name and birth date.",
    "What are the birth dates and first names of players from the United States?",
    "Find out the average age of winners and losers in all matches.",
    "What are the mean ages of the players who lost and won in the matches?",
    "What is the average rank of winners in all matches?",
    "What is the average rank for champions in all matches?",
    "What is the highest rank of the losers across all matches?",
    "What is the top rank of the losing players for all the matches?",
    "What is the count of unique country codes for all players?",
    "How many players come from different countries?",
    "Find the number of distinct names of defeated players.",
    "How many loser names are there in total?",
    "Find the name of the tournament with more than 10 matches.",
    "What tournaments have more than 10 matches in them?",
    "Question: Enumerate the names of all champions who participated in both 2013 and 2016.",
    "What are the players' names who emerged victorious in both 2013 and 2016?",
    "List all the matches played in the years 2013 and 2016.",
    "How many games were played in either 2013 or 2016?",
    "What are the first names and country codes of the players who emerged victorious in both the WTA Championships and the Australian Open?",
    "What are the first names and country codes of players who have won both the Australian Open and the WTA Championships?",
    "Find the oldest player's first name and country code.",
    "What are the first names and country codes of the oldest player?",
    "List all the players' first and last names in the order of their birth date.",
    "What are the names of all players sorted by their birth date?",
    "List all players who are left / L hand in the order of their birth date, and provide their first and last names.",
    "What are the names of all left handed players, ordered by their birth dates?",
    "Find out the country code and first name of the player who has the highest number of tours.",
    "What are the first name and country code of the player with the highest number of tours?",
    "What year had the highest number of matches played?",
    "Which year had the most number of matches played?",
    "Find the winner's name and rank points who won the most number of times.",
    "What is the identity of the victorious person who has won the most matches, and what is the quantity of rank points that this competitor possesses?",
    "Find out the name of the champion who has the highest rank points and participated in the competition of Australian Open.",
    "What's the name of the winner who has the highest rank points and participated in the Australian Open tournament?",
    "question: discover the names of the losing and winning players who participated in the match with the highest number of minutes.",
    "What are the identities of the victor and the defeated player in the longest match?",
    "Find the average ranking for each player and their given name.",
    "What are the players' first names and their average rankings?",
    "What is the total ranking points for each player and their first name?",
    "What are the players' first names and their total ranking points?",
    "Find the number of players for each nation.",
    "How many players are there from each country?",
    "Find the country code of the nation with the most number of players.",
    "What is the country code of the nation with the highest number of players?",
    "Find countries with over 50 players.",
    "What are the country codes for countries with over 50 players?",
    "Find the total number of tours for each ranking date.",
    "How many tours were there in total for each ranking date?",
    "Find the count of matches played in each year.",
    "How many games were played annually?",
    "Find the name and rating of the three most youthful victors across all matches.",
    "What are the names and ranks of the three most youthful victors across all matches?",
    "How many winners who were left-handed participated in the WTA Championships?",
    "Find the count of left-handed winners who took part in the WTA Championships.",
    "What are the first name, country code and birth date of the player who achieved the highest rank points in all matches?",
    "What are the first name, country code, and birth date of the player holding the most winner rank points across all matches?",
    "Find the count of players for each hand category.",
    "How many players exist for every hand type?",
    "How many ships were 'Captured'?",
    "What is the tonnage and name of the ships, ordered by name in descending order?",
    "List all the battles along with their dates and outcomes.",
    "What is the maximum and minimum death toll caused in each battle?",
    "What is the mean number of injuries per incident?",
    "What are the situations of injury and death caused by the ship with tonnage 't'?",
    "What are the battles' names and results when the Bulgarian commander is not 'Boril'?",
    "What are the names and ids of the battles where any ships of type 'Brig' were lost?",
    "What are the battle IDs and names where over 10 individuals were killed in total?",
    "What is the ID and name of the ship that caused the highest number of injuries overall?",
    "What are the different names of the battles fought by Bulgarian commander 'Kaloyan' and Latin commander 'Baldwin I'?",
    "How many battles have different results?",
    "How many battles did not lose any ship with tonnage '225' and what is the number of ships that were lost?",
    "What is the name and date of the battle in which the ships 'Lettice' and 'HMS Atalanta' were lost?",
    "Show me the names, results, and Bulgarian commanders of the battles in the 'English Channel' where no ships were lost.",
    "What are the notes of the death events that contain the substring 'East'?",
    "What are all the addresses, including the first and second line?",
    "Post-perturbation question: What are the first and second lines for all the addresses present?",
    "How many courses are there in total?",
    "How many classes are there?",
    "How would one describe the math course?",
    "What are the math courses and their descriptions?",
    "What is the zip code of the address in Port Chelsea?",
    "What is the zip code for Port Chelsea, may I ask?",
    "Which department provides the highest number of degrees? Please list the department name and ID.",
    "What's the department with the most degrees in terms of ID and name?",
    "How many degree-granting departments are there?",
    "How many degrees are offered by various departments?",
    "How many degree names are offered?",
    "How many degrees are available?",
    "How many degree programs are offered by the engineering department?",
    "How many degrees are there in the engineering department?",
    "Question: What are the titles and explanations of all the sections?",
    "Perturbed question: What are the titles and explanations for all the sections?",
    "What are the names and id of courses with a maximum of 2 sections available?",
    "What are the course ids and names of all courses that have fewer than 2 sections?",
    "List the name of the section in reverse alphabetical order.",
    "What are the names of the sections in reverse order of the alphabet?",
    "What is the semester with the highest number of students enrolled? Show both the name and the id.",
    "For each term, what is the id and name of the one with the highest number of registered students?",
    "What is the description of the department that contains the substring computer in its name?",
    "Question: What is the department description for the one whose name contains the word computer?",
    "Who is enrolled in two degree programs in one semester? Provide the first name, middle name, last name, and id.",
    "What are the first, middle, and last names, along with the ids, of all students who registered for two degree programs during one semester?",
    "Who is registered in a Bachelor degree program? Please provide the first name, middle name, and last name of the students.",
    "What are the first, middle, and last names for all students currently enrolled in a Bachelor's program?",
    "Find the program with the highest number of students enrolled?",
    "What degree summary name has the highest number of students enrolled?",
    "Find the program that has the highest number of students enrolled. Please provide both the id and the summary.",
    "What is the degree summary name and the id of the program with the highest number of enrolled students?",
    "Which student has registered for the highest number of programs? Please provide their id, first name, middle name, last name, student id and the number of enrollments.",
    "What is the student's first, middle, and last name, as well as their ID and the number of enrollments, for the student who enrolled the least in any program?",
    "Which semesters do not have any students enrolled? Please list the name of the semesters.",
    "What is the name of the semester in which no students are enrolled?",
    "What are all the course names of courses that have ever had students enrolled?",
    "What courses have students enrolled in them?",
    "What is the course name with the highest number of enrollments?",
    "What's the course name with the highest number of students enrolled?",
    "Find the family name of the students who currently reside in North Carolina but have not enrolled in any degree program.",
    "What are the surnames of students residing in North Carolina who have not enrolled in any degree programs?",
    "Show me the id and date of the transcript that has at least 2 course results.",
    "What is the transcript date and id for a transcript with at least two courses listed?",
    "What's the phone number of the man named Timmothy Ward?",
    "What is the mobile phone number of the student named Timmothy Ward, please?",
    "Who is the first pupil to register? List the first, middle and last name.",
    "What are the first, middle, and last names of the first registered student?",
    "Who was the first student to graduate from the school? Please provide their first, middle, and last name.",
    "What are the first, middle, and last names of the earliest graduate from school?",
    "Whose current address differs from their permanent address? Please list their first name.",
    "What is the given name of the student whose current address differs from their permanent one?",
    "Which address has the highest number of students at present? Please provide the address id and all lines.",
    "What is the address id, line one, and line two of the address with the largest number of students?",
    "Post-perturbation question: What is the date range of transcript printing?",
    "What is the transcript date average?",
    "When will the initial transcript be released? Provide the details and date.",
    "What are the details of the earliest transcript release date?",
    "How many transcripts have been released?",
    "How many transcripts do we have listed?",
    "What is the most recent date that the transcript was released?",
    "When was the latest transcript released?",
    "How many times can a course enrollment result appear in different transcripts at most? Please also provide the course enrollment id.",
    "What is the course with the highest number of enrollments across multiple transcripts and what is its enrollment ID?",
    "Show me the date of the transcript that has the fewest results and also display the id.",
    "What is the ID and date of the transcript with the smallest number of results?",
    "Find the semester in which both Master and Bachelor students were enrolled in.",
    "What is the identification number of the semester where both Bachelors and Masters students were enrolled?",
    "How many students are currently living at different addresses?",
    "What are the various locations where students reside?",
    "List all the details of the students in reverse alphabetical order.",
    "What can you tell me about students in reverse alphabetical order, but in a different writing style?",
    "Perturbed question: Can you please provide details of the student_transcripts_tracking section?",
    "question: What's the description for the section h?",
    "Find the first name of students who live permanently in Haiti or have the cell phone number 09700166582.",
    "What are the first names of the pupils who reside in Haiti permanently or possess the cell phone number 09700166582?",
    "What is the alphabetical order of all cartoon titles?",
    "What are the titles of the animated shows sorted alphabetically?",
    "List all animated shows directed by \"Ben Jones\".",
    "What cartoons were directed by Ben Jones?",
    "How many cartoons did \"Joseph Kuhr\" write?",
    "What is the count of cartoons authored by Joseph Kuhr?",
    "List all animated titles and their directors sorted by their airing date.",
    "What are the titles and directors of all the cartoons that have been ordered by their air dates?",
    "List all the cartoon titles directed by \"Ben Jones\" or \"Brandon Vietti\".",
    "What are all the cartoons directed by Ben Jones or Brandon Vietti?",
    "Which country has the highest number of TV channels available? Please provide the name of the country and the corresponding number of TV channels.",
    "What country has the greatest number of TV channels and how many are available there?",
    "How many TV Channel table series names and contents are there?",
    "How many series and contents are listed in the TV Channel table?",
    "What is the content of the TV channel \"Sky Radio\"?",
    "What exactly does Sky Radio series contain?",
    "What is the Package Option of TV Channel with serial name \"Sky Radio\"? ",
    "What are the Package Options available for TV Channels that have the series name Sky Radio?",
    "How many TV channels use the English language?",
    "How many English language TV Channels are there?",
    "List the language used least number of TV Channel. List language and number of TV Channel. ",
    "What is the language that the fewest TV channels use and how many channels use it?",
    "List all the TV channels and their corresponding languages.",
    "For every language, enumerate the quantity of TV Channels that employ it.",
    "What TV channel broadcasts the cartoon \"The Rise of the Blue Beetle!\"? Provide the name of the series on the channel.",
    "What is the name of the TV Channel that airs the cartoon \"The Rise of the Blue Beetle\"?",
    "List all cartoons shown on TV channel \"Sky Radio\" with their respective series names.",
    "What is the name of every cartoon that airs on the TV Channel \"Sky Radio\"?",
    "List all TV series episodes sorted by rating.",
    "What is the order of all the episodes by their ratings?",
    "List the top 3 highest-rated TV series and provide their respective episode and rating.",
    "What were the ratings of the top 3 episodes in the TV show table?",
    "What is the minimum and maximum percentage of TV series viewership?",
    "What are the highest and lowest shares for the TV series?",
    "What is the air date of TV series with Episode \"A Love of a Lifetime\"? ",
    "When was \"A Love of a Lifetime\" episode broadcasted?",
    "What is the weekly rank of the TV series that has the episode \"A Love of a Lifetime\"?",
    "What is the rank of the episode \"A Love of a Lifetime\" on a weekly basis?",
    "What TV channel airs the TV series episode \"A Love of a Lifetime\"? List the name of the series on the channel.",
    "What's the title of the series that includes the episode \"A Love of a Lifetime\"?",
    "List all TV series episodes that were broadcasted on the TV Channel featuring the series named \"Sky Radio\".",
    "What is the episode for the TV show called \"Sky Radio\"?",
    "Find out how many cartoons have been directed by each of the directors mentioned in the list.",
    "How many cartoons were created by each director?",
    "What is the production code and channel of the cartoon that was most recently aired?",
    "What is the production code and channel of the latest animated show?",
    "What is the name of the series and package option of the TV channel that offers high definition TV?",
    "What are the package options and series name for the TV channel that supports high definition TV?",
    "Which countries are showing a cartoon written by Todd Casey on their TV channels?",
    "What countries have TV shows with cartoons written by Todd Casey?",
    "Which countries are not broadcasting any cartoons written by Todd Casey?",
    "What countries do not air cartoons written by Todd Casey?",
    "What is the name of the TV channel and its country that is airing cartoons directed by Michael Chang and Ben Jones?",
    "What is the name of the series and the country where all TV channels are broadcasting cartoons directed by Ben Jones and cartoons directed by Michael Chang?",
    "Find the pixel aspect ratio and country of the TV channels that do not utilize English.",
    "What are the pixel aspect ratio and country of origin for all TV channels that do not use English?",
    "Find the IDs of TV channels from countries with more than two TV channels.",
    "What are the IDs of all TV channels with more than two TV channels?",
    "Find the TV channels that do not broadcast any cartoons directed by Ben Jones.",
    "What are the TV channel IDs that don't have any cartoons directed by Ben Jones?",
    "Find the package option of the TV channel that does not have any cartoons directed by Ben Jones.",
    "What are the package options of all TV channels that do not play cartoons directed by Ben Jones?",
    "How many people play poker?",
    "What is the count of poker players?",
    "What is the descending order of earnings for poker players?",
    "What is the ranking of poker players based on their earnings, in descending order?",
    "List the best finishes and final tables achieved by poker players.",
    "What are the best finishes and final tables made by all the poker players?",
    "What is the mean income of poker players?",
    "What is the mean earnings of all poker players?",
    "What's the rank of the poker player with the most earnings?",
    "What is the money rank of the player who has earned the most?",
    "What is the highest number of final tables achieved by poker players earning less than 200000?",
    "What is the highest number of final tables made by poker players with earnings under 200k?",
    "What are the monikers of poker players?",
    "What are the names of all the players who play poker?",
    "What are the names of poker players who have earned more than 300000?",
    "Which poker players have earned more than 300000 dollars?",
    "What is the ascending order of final tables made by poker players?",
    "What are the names of players who play poker, ordered in ascending order according to their final tables?",
    "What is the date of birth of the poker player with the least earnings?",
    "What is the birth date of the poker player with the lowest earnings?",
    "What is the money rank of the poker player who stands tallest?",
    "What is the money rank of the tallest poker player?",
    "What's the mean income of poker players taller than 200 cm?",
    "What is the average earnings of poker players taller than 200?",
    "What is the order of poker players by their earnings, from highest to lowest?",
    "What are the names of poker players sorted by their earnings in descending order?",
    "What are the various countries from which people belong and how many individuals belong to each country?",
    "How many individuals are present for every country?",
    "What nationality do most people have?",
    "What is the most common nationality among all the individuals?",
    "What nationalities are shared by more than one person?",
    "Return all nationalities with at least two people.",
    "What are the names and birth dates of people in ascending alphabetical order of name?",
    "What are the birth dates and names of people, ordered by their names in alphabetical order?",
    "Show the names of individuals who are not from Russia.",
    "What are the names of individuals who are not from Russia?",
    "What are the names of individuals who do not play poker?",
    "What are the names of individuals who do not partake in poker?",
    "How many different countries are represented?",
    "What is the count of distinct nationalities?",
    "How many states exist?",
    "List the contestant numbers and names, ordered by name of the contestant in descending order.",
    "List all the vote IDs, phone numbers and states associated with each vote.",
    "What are the upper and lower limits of area codes?",
    "What's the final date that votes were created from 'CA'?",
    "What are the names of the participants who are not named 'Jessie Alloway'?",
    "What are the different states and creation times of all votes?",
    "What are the numbers and names of the contestants who received at least two votes?",
    "What is the name and number of the contestant who received the fewest votes among all the contestants who were voted for?",
    "What is the vote count for states 'NY' and 'CA'?",
    "How many participants were not selected?",
    "What area code had the highest turnout of voters?",
    "What is the create date, state, and phone number of the votes for the competitor named 'Tabatha Gehling'?",
    "What are the area codes where voters supported both 'Tabatha Gehling' and 'Kelly Clauss'?",
    "Return the names of the participants containing the substring 'Al'.",
    "What countries gained independence after 1950?",
    "What are the names of the countries that were established post-1950?",
    "How many nations have a republic as their form of governance?",
    "How many republics are there in the world?",
    "What's the total surface area of the Caribbean countries?",
    "How many square kilometers do the Carribean nations collectively occupy?",
    "In which continent is Anguilla situated?",
    "What continent is Anguilla a part of?",
    "In which region is the city Kabul situated?",
    "In which region is Kabul located?",
    "What is the most commonly spoken language in Aruba?",
    "What is the primary language spoken in Aruba?",
    "What is the life expectancy and population in Brazil?",
    "Give me the population and life expectancies of Brazil.",
    "What is the population and region of Angola?",
    "What is the population of Angola and which region it is part of?",
    "What is the mean life expectancy for nations located in Central Africa?",
    "How much time does the average person live in Central Africa?",
    "What country in Asia has the lowest life expectancy?",
    "What Asian country has the lowest life expectancy?",
    "What is the total population and highest GNP in Asia?",
    "How many individuals reside in Asia, and what is the highest GNP among them?",
    "What is the life expectancy of republics in Africa on average?",
    "What is the life expectancy on average for republics in Africa?",
    "What is the combined surface area of Asia and Europe's continents?",
    "Give the total area that countries in Asia or Europe cover.  (Note: I changed \"surface area\" to \"area\" and \"covered\" to \"cover\" to alter the writing style)",
    "How many individuals reside in the district of Gelderland?",
    "What is the population count of Gelderland district?",
    "What are the GNP and population of all countries that are US territories on average?",
    "Give me the total population and mean GNP of the US territory nations.",
    "How many distinct languages are there globally?",
    "What's the count of unique languages spoken worldwide?",
    "How many governments are there in Africa?",
    "How many types of governance exist in Africa?",
    "What is the total count of languages spoken in Aruba?",
    "How many dialects are spoken in Aruba?",
    "How many languages are considered official in Afghanistan?",
    "How many languages are officially spoken in Afghanistan?",
    "What country speaks the most languages?",
    "What is the name of the country that uses the most number of languages?",
    "What is the continent with the highest language diversity?",
    "Which continent has the highest number of languages spoken?",
    "How many nations speak both English and Dutch?",
    "What is the count of countries that speak both English and Dutch?",
    "What are the nations that speak both English and French languages?",
    "Give me the names of countries where people speak English and French.",
    "What are the countries where both French and English are official languages spoken?",
    "Give me the names of the countries where both English and French are official languages.",
    "What is the count of continents where Chinese language is spoken?",
    "How many continents communicate in Chinese?",
    "What regions utilize Dutch or English?",
    "Which areas communicate in English or Dutch?",
    "What are the nations where either English or Dutch is the official language?",
    "Which nations possess either English or Dutch as an official language?",
    "What is the most commonly used language in Asia?",
    "What language is spoken by the most Asian countries?",
    "Which languages are spoken by just one nation under republican governments?",
    "What are the languages used by a republic government country exclusively?",
    "What is the English-speaking city with the highest population?",
    "What is the largest English-speaking city by population?",
    "What is the name, population and life expectancy of the largest Asian country by area?",
    "What's the life expectancy, population, and name of the biggest Asian country by land area?",
    "What is the mean lifespan in countries where English isn't the official language?",
    "What is the average life expectancy of countries where English is not the official language?",
    "What is the total count of residents in countries where English is not the official language?",
    "How many individuals reside in nations where English is not spoken?",
    "What language is spoken in the country where Beatrix is the head of state?",
    "What language is spoken in the country with Beatrix as its head of state?",
    "What is the number of unique official languages spoken in countries founded before 1930 in total?",
    "What is the total count of official languages in countries that were established prior to 1930?",
    "What are the countries that have a larger surface area than any European country?",
    "Which nations have a larger area than any European country?",
    "What are the African nations with a population lower than any Asian country?",
    "Which countries in Africa have a population smaller than any country in Asia?",
    "Which African countries have a population that is smaller than any country in Asia?",
    "What are the Asian nations that have a larger population than any African country?",
    "What are the codes for countries that don't speak English?",
    "Return the codes of the countries that don't speak English.",
    "What are the codes of the countries where people speak languages other than English?",
    "Give me the country codes for countries where languages other than English are spoken.",
    "What are the codes of the countries that don't speak English and their government forms are not Republic?",
    "Return the codes of countries that do not speak English and do not have republics for governments except for those that are monarchies.",
    "Which cities are located in European countries where English is not the official language?",
    "What cities in Europe have a non-English official language? ",
    "What are the distinct cities present in Asian countries where Chinese is the official language spoken?  ",
    "What are the names of cities in Asia where the official language is Chinese?",
    "What is the name, year of independence, and surface area of the nation with the least population?",
    "What is the name, year of independence, and surface area of the country with the smallest population?",
    "What is the name of the country with the largest area and what are its population and leader?",
    "What is the name of the country with the largest area, and who is its head of state?",
    "Return the names of countries and the count of languages spoken in each country that speaks a minimum of three languages.",
    "What countries speak more than 2 languages and how many languages do they speak?",
    "What is the count of cities in each district with a population greater than the average population of cities?",
    "How many towns in each district have a population that exceeds the mean population of all towns?",
    "Find the name of the government form and the total population for each government form where the average life expectancy is greater than 72.",
    "What is the total population for each government form with an average life expectancy greater than 72, and what are the different forms of government?",
    "Find the mean life expectancy and total populace for each continent where the mean life expectancy is less than 72?",
    "What are the continents with population and life expectancy data for those with an average life expectancy of less than 72 years?",
    "What are the names and areas of countries with the largest 5 areas?",
    "What are the names and surface areas of the top 5 biggest countries?",
    "What are the names of the countries with the largest 3 populations?",
    "Return the names of the three most populous countries.",
    "What countries have the 3 smallest populations?",
    "What are the names of the three countries with the smallest population?",
    "How many Asian countries are there?",
    "What is the count of Asian countries?",
    "What countries in Europe have a population of 80000 and what are their names?",
    "Give me the names of countries in Europe that have a population of 80000? ",
    "What is the population total and average area of countries in North America with area larger than 3000?",
    "Give me the total population and average surface area of North American countries with surface areas greater than 3000.",
    "What cities have a population between 160000 and 900000?",
    "Return the names of cities with a population between 160K and 900K.",
    "What is the language spoken by the most number of countries?",
    "What is the language spoken in the largest number of countries?",
    "What language do most people speak in each country?",
    "What are the different country codes and the languages spoken by the highest percentage of people in each country?",
    "What is the count of countries where Spanish is spoken by the largest percentage of people in total?",
    "What is the count of countries where the primary language spoken is Spanish?",
    "What are the country codes in which the highest percentage of people speak Spanish?",
    "What are the codes of the countries where Spanish is the most spoken language?",
    "How many musicians are there?",
    "What is the count of conductors?",
    "What is the ascending order of age for conductors?",
    "What are the conductors' names, ordered by their age?",
    "What are the names of conductors whose nationalities are not from the United States?",
    "Return the names of conductors who are not from the \"USA\".",
    "What are the orchestras' record companies sorted by the year they were founded in descending order?",
    "Return the record companies of orchestras in descending order of the year they were founded.",
    "What is the attendance of shows on average?",
    "What is the mean attendance of all performances?",
    "What is the range of shares for performances that are not \"Live final\" type?",
    "Return the maximum and minimum shares for performances that aren't \"Live final\".",
    "How many nationalities are represented by the conductors?",
    "What is the count of unique conductor nationalities?",
    "What is the descending order of conductors based on their years of work?",
    "What are the names of maestros, sorted in a descending order by the number of years they have been working?",
    "What conductor has the most years of experience?",
    "What conductor has worked the most years?",
    "Show me the orchestras conducted by each conductor along with their names.",
    "What are the orchestras that conductors have conducted and what are their corresponding names?",
    "Show me the names of maestros who have conducted more than one orchestra.",
    "What are the names of maestros who have directed more than one orchestra?",
    "What conductor has conducted the highest number of orchestras?",
    "What conductor has led the largest number of orchestras?",
    "Please display the name of the conductor who has conducted orchestras founded after 2008.",
    "What are the conductor names of orchestras established after 2008?",
    "Please display the record labels and the number of orchestras associated with them.",
    "How many symphonies does every record label manage?",
    "Please display the formats of orchestras with increasing count.",
    "What are the most common record formats for orchestras, sorted by frequency?",
    "What is the record company shared by the largest number of orchestras?",
    "What is the record label that is utilized by the largest number of orchestras?",
    "List the names of orchestras which haven't held any performances.",
    "What orchestras have no performances scheduled?",
    "Show me the record companies shared by orchestras established prior to 2003 and those established after 2003.",
    "What record companies do both orchestras established before 2003 and those established after 2003 use?",
    "Find out the count of orchestras that have their record format as either \"CD\" or \"DVD\".",
    "What is the count of orchestras that have their record format as CD or DVD?",
    "Show the years in which orchestras that have performed more than once were established.",
    "What are the founding years of orchestras that have had more than one performance?",
    "How many high-school students are there?",
    "What is the count of high school students?",
    "Show me the names and grades of every high school student.",
    "What are the grades and names of every high school student?",
    "Show me the grades of all the high school students.",
    "What grade did each high school student earn?",
    "In what grade is Kyle?",
    "What is the grade of the high school student called Kyle?",
    "Show me the names of all sophomores in high school.",
    "What are the names of all 10th grade high school students?",
    "What is the ID of the high schooler called Kyle?",
    "What is the ID of Kyle?",
    "How many 9th or 10th graders are enrolled in high school?",
    "How many students are in grades 9 or 10 at the high school?",
    "Show me the count of students in each grade level in high school.",
    "How many students are enrolled in each grade level?",
    "Which grade has the largest number of high school students?",
    "What is the grade with the highest number of high school students?",
    "Show me all the grades that have a minimum of 4 students.",
    "Which high school grades have at least 4 students?",
    "Show me the IDs of students and their corresponding number of friends.",
    "How many pals does each pupil possess?",
    "Show the number of friends each high school student has along with their names.",
    "What are the monikers of the high school students and how many pals does each possess?",
    "What's the name of the high school student with the most pals?",
    "What is the name of the high school student with the most friends?",
    "Show me the high school students who have a minimum of 3 friends.",
    "What are the monikers of high schoolers that possess 3 or more comrades?",
    "How about this: \"Display the names of all friends of Kyle, who is a high school student.\"",
    "What are the names of Kyle's friends?",
    "How many pals does Kyle, the high school student, have?",
    "How many buddies does Kyle have?",
    "Show the IDs of all students who do not have any pals.",
    "What are the IDs of high school students who have no friends?",
    "Show me the names of all high school students who have no buddies.",
    "What are the names of students who do not have any friends?",
    "Show me the ids of high school students who have friends and are also appreciated by someone else.",
    "What are the student ids of those who are both liked and have friends?",
    "Show me the names of all students who have friends and are liked by someone else.",
    "What are the names of high school students who are both popular and have friends?",
    "Count how many likes each student has received.",
    "How many likes are associated with each student ID?",
    "Show me the high school students who have likes, and the number of likes for each.",
    "What are the titles of the high school students who have likes, and how many likes does each student receive?",
    "What's the name of the high schooler with the highest number of likes?",
    "What is the name of the student with the highest number of likes?",
    "Show me the students who have received at least two likes.",
    "What are the names of students who have two or more likes?",
    "Show the names of pupils who have a grade greater than 5 and possess at minimum 2 buddies.",
    "What are the names of high schoolers who have a grade of over 5 and have two or more pals?",
    "How many likes does Kyle possess?",
    "What is the count of likes that belong to Kyle who is a high school student?",
    "Find the mean grade of all students who have some friends.",
    "What's the mean grade of students who have pals?",
    "What is the minimum grade of students who do not have any friends?",
    "What is the minimum grade of students who do not have any friends?",
    "Perturbed question: What states do professionals and owners reside in together?",
    "Find the regions where both proprietors and experts reside.",
    "What's the mean age of dogs that underwent any treatments?",
    "What is the average age of dogs that received treatments?",
    "Which professionals reside in the state of Indiana or have had more than two treatments performed? Please provide their id, last name, and cell phone number.",
    "Find professionals' id, last name, and cell phone who reside in Indiana or have carried out more than two treatments.",
    "Which pups haven't cost their owners more than 1000 dollars for treatment? Please provide the names of these dogs.",
    "What are the dog names for which the owner has spent not more than 1000 dollars on treatment?",
    "What are the names of professionals or owners that are not used for dog names?",
    "Find the professionals' first names who are not dog owners and are not used as dog names.",
    "Which professional did not perform any treatments on dogs? Please provide the professional's id, role, and email.",
    "Give me the id, role and email of the professionals who have not performed any treatment on canines.",
    "Which individual possesses the largest number of dogs? Please provide the id, first name, and last name of the owner.",
    "Return the ID of the owner, first name and last name of the owner who has the most dogs.",
    "Which professionals have administered at least two treatments? Please show the professional's id, role, and first name.",
    "What are the professionals' id, role, and first name who have performed more than one treatment?",
    "What is the breed with the highest number of dogs?",
    "Which breed has the highest number of dogs? Please provide the name of the breed.",
    "Which individual has paid for the highest number of treatments on their dogs? Please provide the id and last name of the owner.",
    "Tell me which owner has spent the most on treating their dog and what is their last name?",
    "What's the treatment type description for the cheapest total cost?",
    "Give me the explanation of the treatment category that has the least amount of cost.",
    "Which individual has paid the highest amount in total for their canines? Display the owner identification number and zip code.",
    "Find the zip code and owner id of the owner who has spent the highest total amount for their dogs.",
    "Which professionals have carried out at least 2 types of treatments? Please provide their professional id and cell phone.",
    "Find the professionals' cell phone and id who perform two or more types of treatments.",
    "What are the first name and last name of the professionals who have undergone treatment with a cost below average?",
    "Which professionals have administered a treatment that is cheaper than the average? Please provide me their first and last names.",
    "List the date of every treatment and the first name of the professional who performed it.",
    "Perturbed question: What is the first name of the professional and the date of each treatment?",
    "Post-perturbation question: Enumerate the cost of every treatment and the corresponding description of the treatment type.",
    "What are the expenses and description of treatment type for each treatment?",
    "List the first name, last name, and the size of each dog owner.",
    "What are the first name, last name, and the size of each dog owner?",
    "List all the pairs of the owner's name and their dog's name.",
    "What are the first names of each dog owner and the names of their dogs?",
    "List the titles of the dogs of the rarest breed and the dates of their treatments.",
    "Which dogs belong to the rarest breed? Display their names and dates of treatment.",
    "Which canines are possessed by an individual residing in Virginia? Enumerate the initial name of the possessor and the name of the dog.",
    "Find the names of dog owners residing in Virginia and the dogs they possess.",
    "What is the date of arrival and departure of dogs that have undergone a treatment?",
    "Find out the dates of arrival and departure of the dogs that were treated.",
    "What is the last name of the owner who owns the youngest dog?",
    "Who is the owner of the youngest dog? Please provide their last name.",
    "List the emails of the professionals who reside in Hawaii or Wisconsin.",
    "What are the emails of the professionals residing in either Hawaii or Wisconsin?",
    "What is the arrival date and departure date for all canines?",
    "Perturbed question: What are the dates of arrival and departure for all the canines?",
    "How many canines underwent any treatments?",
    "How many dogs received a treatment?",
    "How many dog specialists have administered any treatment to canines?",
    "Find the count of animal experts who have ever taken care of canines.",
    "Which individuals reside in a city containing the substring 'West'? List their position, street, city and state.",
    "Find the occupation, address, town and state of the professionals residing in a town that has the substring 'West'.",
    "Which proprietors reside in the state with a name containing the substring 'North'? Please provide the first name, last name, and email.",
    "Return the email, first name and last name of the owners residing in a state containing the substring 'North'.",
    "How many dogs possess an age lower than the mean age?",
    "Count the number of canines younger than the mean age.",
    "How much is the cost for the most recent treatment?",
    "Show me the price of the most recently performed treatment.",
    "How many dogs haven't received any treatment?",
    "Tell me the number of canines that have not received any treatment.",
    "How many individuals who own dogs temporarily do not have any of them?",
    "Find out the number of individuals who don't possess any dogs currently.",
    "How many experts did not perform any treatment on canines?",
    "Find the count of professionals who have never treated any dogs.",
    "List the dog names, ages and weights of the abandoned dogs? 1 represents yes and 0 represents no.",
    "What are the dog names, ages, and weights of the abandoned dogs? Note that 1 represents yes, and 0 represents no in the tables.",
    "What's the mean age of all the canines?",
    "What is the average age of all the canines?",
    "What is the age of the oldest canine?",
    "Tell me the age of the most senior dog.",
    "How much does each type of charge cost? Please provide the charge type and its corresponding amount.",
    "Perturbed question: What are the charge types and their respective amounts?",
    "perturbed_question: What is the price of the most expensive charge type?",
    "What is the cost of the most expensive charge type?",
    "List all the professionals' email, cell phone, and home phone.",
    "Perturbed question: What is the email, mobile phone and home phone of every professional?",
    "What are all the feasible combinations of breed and size types?",
    "Find the dog breed and size combinations that are unique.",
    "List all the professionals' first names and the description of the treatments they've performed.",
    "What is the first name of each professional who has performed a treatment and their treatment description?",
    "How many vocalists are there?",
    "What is the number of vocalists?",
    "What is the ascending order of net worth for singers?",
    "What is the list of singers sorted by increasing net worth?",
    "What is the birth year and nationality of vocalists?",
    "What is the nationality and year of birth of the vocalists?",
    "List the name of singers who are not citizens of \"France\".",
    "What are the names of the vocalists who are not citizens of France?",
    "Show me the names of the singers who were born in 1948 or 1949.",
    "What are the names of the vocalists born in either 1948 or 1949?",
    "What singer has the highest net worth?",
    "What's the name of the singer with the highest net worth?",
    "Show the number of singers of each citizenship and their respective citizenships.",
    "For every country, what is the count of singers who have that citizenship?",
    "Please display the citizenship that most singers have?",
    "What nationality is the most frequent among singers?",
    "Show the maximum net worth of singers for each citizenship and their respective citizenships.",
    "For every nationality, what is the highest net worth?",
    "Show me the singer names and song titles.",
    "What are the names of the singers and titles of the songs?",
    "Show me the unique names of singers who have tracks with sales exceeding 300000.",
    "What are the singers who have sold more than 300000 records?",
    "Show me the names of vocalists who have more than one song.",
    "What are the titles of the songs sung by singers who have more than one song?",
    "Show the total sales of the tracks and the names of the singers who sang them.",
    "For every singer, what is the sum of sales for the songs they've sung?",
    "What singers have no songs?",
    "What is the name of each singer who has no songs?",
    "Show the nationalities of the singers born before 1945 and after 1955.",
    "What citizenships do singers who were born before 1945 and after 1955 have in common?",
    "How many features are currently available in total?",
    "What is the name of the type of feature that AirCon belongs to?",
    "Show me the descriptions of the types of properties that belong to that code.",
    "What are the names of houses or apartments with more than one room available for purchase?"
]