[
    "How many sngers do we have?",
    "What is teh total number of singers?",
    "Show name, country, age for all singrs ordered by age from the oldest to the youngest.",
    "What are the names, countries, and ages for every singr in descending order of age?",
    "What is the average, minimum, and maximum age of all singers from Frane?",
    "What is the avergae, minimum, and maximum age for all French singers?",
    "Show the name and the release yeqr of the song by the youngest singer.",
    "What are the names and release years for all the songs of the youngest singr?",
    "What are all distinct countries where singers above age 20 are fromm?",
    "What are the different countries with singers abovve age 20?",
    "Show all countires and the number of singers in each countires.",
    "How many singers are from eacch country?",
    "List all song names by singers above the average ag.",
    "What are all the song names by singers who are older than averge?",
    "Show locatoin and name for all stadums with a capacity between 5000 and 10000.",
    "What ar the locations and names of all stations with capacity between 5000 and 10000?",
    "What is the maximum capactiy and the average of all stdaiums ?",
    "What is the average and maximum capacitie for all stadium ?",
    "What is the name and capacit for the stadium with highest average attendance?",
    "What is the name and capasity for the staduim with the highest average attendence?",
    "How many concerts are there in yeaar 2014 or 2015?",
    "How many concerts occured in 2013 or 2015?",
    "Show the stadim name and the number of concerts in each stadium.",
    "For each stadiom, how many concerts play there?",
    "Show the stadim name and capacity with most number of concerts in year 2014 or after.",
    "What is the name and capacity of the stadim with the most concerts after 2013 ?",
    "Which yer has most number of concerts?",
    "What is the yar that had the most concerts?",
    "Show the staduim names without any concert.",
    "What are the nams of the stadims without any concerts?",
    "Show countries where a singer above age 40 and a singer below 30 are from.  Post-perturbation question: Show countries where a singer above age 40 and a singer below 20 are from.",
    "Show nmes for all stadiums except for stadiums having a concert in year 2014.",
    "What are the names of all staduims that did not have a concert in 2014?",
    "Show the nme and theme for all concerts and the number of singers in each concert.",
    "What are the namess , themes , and number of singerss for every concert ?",
    "List singer names and number of concerts for each singre.",
    "What are the namess of the singers and number of concerts for each person?",
    "List all singer names in concerst in year 2014.",
    "What are the nams of the singrs who performd in a concrt in 2014?",
    "what is the name and nation of the singer who have a song having 'Heyy' in its name?",
    "What is the name and country of orgin of every singer who has a song with the word 'Hy' in its title?",
    "Find the name and location of the staduims which some concerts happened in the years of btoh 2014 and 2015.",
    "What are the names and locatons of the stadums that had concerts that occured in both 2014 and 2015?",
    "Find the number of concerts happend in the stadim with the higest capacity.",
    "What are the number of concerts that occured in the stadum with the largest capacity?",
    "Find the number of petts whose weight is heavier than 10.",
    "How many pets have a greater weight than 1?",
    "Find the weght of the youngest dog.",
    "How much dos the youngest dog weigh?",
    "Find the maximum wight for each type of pet. List the maximum weight and pet type.",
    "List the maxmimum weight and type for each type of pet.",
    "Find numbr of pets owned by students who are older than 20.",
    "How many pets are owned by students that have an age greater than 21?",
    "Find the numbr of dog pets that are raised by female students (with sex F).",
    "How many dogg pets are raised by female students?",
    "Find the numbr of distinct type of pets.",
    "How many different types of pet are their?",
    "Find the frist name of students who have cat or dog pet.",
    "What are the first names of every studnet who has a cat or dog as a pett?",
    "Find the first name of students who have both car and dog pets.",
    "What are the sutdents' first names who have both cats and dogs as pets?",
    "Find the majr and age of students who do not have a cat pet.",
    "What major is every sutdent who does not own a cat as a pet, and also how old are they?",
    "Find the id of students who do not have a cat pett.",
    "What are the ids of the students who do not won cats as pets?",
    "Find the first name and age of students who have a dog but do not have a cat as a pat.",
    "What is the first name of every student who has a dag but does not have a cat?",
    "Find the type and weight of the yongest pet.",
    "What type of pet is the yongest animal, and how much does it weigh?",
    "Find the id and weight of all pets whose age is older thna 1.",
    "What is the id and weight of every pet who is oldeer than 1?",
    "Find the avergae and maximum age for each type of pet.",
    "What is the averge and maximum age for each pet type?",
    "Find the avreage weight for each pet type.",
    "What is the averge weight for each type of pett?",
    "Find the first name and age of studnts who have a pet.",
    "What ar the different first names and ages of the students who do have pets?",
    "Find the id of the pet owned by studnet whose last name is ‘Smth’.",
    "What is the id of the pet owned by the studnet whose last name is 'Smtih'?",
    "Find the number of ptes for each student who has any pet and student id.",
    "For students who have petss , how many pets does each student have ? list their ids instead of names .",
    "Find the first name and gender of studnt who have more than one pet.",
    "What is the frist name and gender of the all the studnets who have more than one pet?",
    "Find the last name of the student who has a cat that is age 3.",
    "What is the last name of the sutdent who has a cat that is 3 years old?",
    "question: Find the avergae age of students wh do not have any pet.",
    "What is the average age for all students who do not own any ptes ?",
    "How many continenets are theree?",
    "What is the numbr of continents?",
    "How many countries dos each continent have? List the continent id, continent name and the number of countries.",
    "For eacj continent, list its id, name, and how many countries it has?",
    "How many countriesr are listed?",
    "How many cuntries exist?",
    "How many models does each car mkaker produce? List maker full name, id and the number.",
    "What is the full name of each car makerr, along with its id and how many models it produces?",
    "Which model of the car has the minimu horsepower?",
    "What is the model of the car with the smallezt amount of horsepower?",
    "Find the modle of the car whose weght is below the average weight.",
    "What is the moddel for the car with a weight smaller than the average?",
    "Find the name of the makres that produced some cars in the yar of 1970?",
    "What is the name of the different car makrs who produced a car in 1970?",
    "Find the make and production time of the cars that were produced in the earlies year?",
    "What is the mker of the car produced in the earliest year and what year was it?",
    "Which distinct car models are the produuced after 1980?",
    "What are the differnt models for the cards produced after 1980?",
    "How many car makers are there in each continetns? List the continent name and the count.",
    "What is the nmae of each continetn and how many car makers are there in each one?",
    "Which of the countries has the most car maker? List the country name.",
    "What is the name of the country with the most car makrs?",
    "How many car model are produced by each maker? Only list the count and the maker full name.",
    "What is the numbr of car models that are produced by each maker and what is the id and full name of each maker?",
    "What is the accelerat of the car make amc hornet sportabout (sw)?",
    "How much dos the car accelerate that makes amc hornet sportabout (sw)?",
    "How many car makerrs are there in france?",
    "What is the number of makrs of care in France?",
    "How many car modles are produed in the usa?",
    "What is the count of the car models produced in the United Stats?",
    "What is the average miles per gallon(mpg) of the cars with 4 cylindres?",
    "What is the average miles per gallon of all the cqrds with 4 cylinders?",
    "What is the smalest weight of the car produced with 8 cylinders on 1974 ?",
    "What is the minimm weight of the car with 8 cylinders produced in 1974 ?",
    "What are all the mkaers and models?",
    "What are the makrs and models?",
    "What are the countries having at least one car makr? List name and id.",
    "What are the namess and ids of all countries with at least one car maker?",
    "What is the number of the cars with horsepower more than 151?",
    "What is the numbr of cars with a horsepower greater than 150?",
    "What is the average weigt of cars each year?",
    "What is the average weight and yer for each year?",
    "Which countries in europ have at least 3 car manufacturers?",
    "What are the names of all Eurpean countries with at least 3 manufacturrs?",
    "What is the maximum horsepower and the make of the car models with 3 cylindres?",
    "What is the largest amount of horspower for the models with 3 cylinders and what make is it?",
    "Which model saves the most gasolline? That is to say, have the maximum miles per galon.",
    "What is the car modle with the highst mpg ?",
    "What is the average horsepowr of the cars before 1980?",
    "What is the average horsepower for all cars produced beore 1980 ?",
    "What is the average edispl of the cars of modell volvo?",
    "What is the average edispl for all volvso?",
    "What is the maximmum acelerate for different number of cylindrs?",
    "What is the maximum acceleratoin for all the different cylinders?",
    "Which model has the most verssion(make) of cars?",
    "What model has the most diffrent versions?",
    "How many cars have more than 3 cylinders?",
    "What is the number of cars with more than 4 cylindres?",
    "how many cars were produced in 198?",
    "In 1980, how many carz were made?",
    "How many car models were produced by the maker with full name American Motor Company?",
    "What is the number of car models created by the car maker American Motor Compnay?",
    "Which makers designed more than 3 car models? List full name and the id.   (Perturbation: \"Which makers designed mor than 3 car models?\")",
    "What are the names and ids of all makrs with more than 3 models?",
    "Which distictive models are produced by maker with the full name Genaral Motors or weighing more than 3500?",
    "What are the different models created by either the car maker General Moters or weighed more than 3500?",
    "In which years cars were produced weighin no less than 3000 and no more than 4000 ?",
    "What are the different years in whcih there were cars produced that weighed less than 4000 and also cars that weighted more than 3000 ?",
    "What is the horsepwer of the car with the largest accelarate?",
    "What is the horspower of the car with the gretest accellerate?",
    "For model volov, how many cylinders does the car with the least accelarate have?",
    "For a volvo model, how many cylinders does the version with least accelerat have?",
    "How many cars have a larger acceleratoin than the car with the largest horsepower?",
    "What is the number of cars with a greater accelarate than the one with the most horsepowr?",
    "How many countries has more than 2 car makerrs ?",
    "What is the number of countries with more than 2 car makerss ?",
    "How many cars has over 6 cylindres?",
    "What is the number of cars with over 6 cylunders?",
    "For the cars with 4 cyliners, which model has the largest horsepower?",
    "For all of the 4 cyliner cars, which model has the most horspower?",
    "Among the cars with more than lowest horepower, which ones do not have more than 3 cylinders? List the car makeid and make name.",
    "question: Among the cars that do not have the minimum horzepower , what are the make ids and names of all those with less than 4 cylinders ?",
    "What is the maximum miles per gallon of the car with 8 cylinders or produced before 1980s ?",
    "What is the maxiumum mpg of the cars that had 8 cylinders or that were produced befor 1980 ?",
    "Which models are lighter than 3500 but not built by the 'Ford Motor Companyy'?",
    "What are the different models that are lighter than 3500 but were not built by the Ford Motor Company?",
    "What are the name of the countries where there is not a single car mkaer?",
    "What are the nanes of the countries with no car makers?",
    "Which are the car makers which produce at least 2 models and more than 3 car makerss ? List the id and the maker.",
    "What are the ids and makrs of all car makers that produce at least 2 models and make more than 3 cars?",
    "What are the id and names of the countries which have more than 3 car makers or produce the 'fiat' model?",
    "What are the ids and names of all countries that either have more than 3 car makers or produce fita model ?",
    "Which country dos Airline \"JetBlue Airways\" belong to?",
    "What country is Jetblu Airways affiliated with?",
    "What is the abbrviation of Airline \"JetBlue Airways\"?",
    "Which abbreviatiom corresponds to Jetblue Airways?",
    "List all airline names and their abbreviations in \"UAS\".",
    "What are the airlin names and abbrviations for airlins in the USA?",
    "List the airport code and name in the city of Anthny.",
    "Give the airport code and airport name corresponding to the city Anthnoy.",
    "How many airlinnes do we havee?",
    "What is the total number of airlinse?",
    "How many airpots do we have?",
    "Return the nmber of airports.",
    "How many flghts do we have?",
    "Return the numbr of flights.",
    "Which airlin has abbreviation 'UAL'?",
    "Give the airlin with abbreviation 'UAL'.",
    "How many airlnes are from USA?",
    "Return the nubmer of aairlines in the USA.",
    "Which ctiy and country is the Alton airport at?",
    "Give the ctiy and country for the Alton airport.",
    "What is the airport name for airport 'AKP'?",
    "Return the name of the airport with code 'AK'.",
    "What are airport names at City 'Aberden'?",
    "What are the namse of airports in Aberdeen?",
    "How many flights depart from 'AOG'?",
    "Count the number of flights departinng from 'AGP'.",
    "How many flights have destiantion ATO?",
    "Count the number of flights into ATO.",
    "How many flights deparrt from City Aberdeen?",
    "Return the number of flights deparating from Abberdeen.",
    "How many flights ariving in Aberdeeen city?",
    "Return the number of flights ariving in Abredeen.",
    "How many flights deparrt from City 'Aberdeen' and have destination City 'Ashley'?",
    "How many flights fly from Aberdeon to Ashley?",
    "How many flights does airlin 'JetBlue Airways' have?",
    "Give the nmber of Jetblue Airways flights.",
    "How many 'Untied Airlines' flights go to Airport 'ASY'?",
    "Count the number of United Airline flights arriving in ASY Airport.",
    "How many 'United Airline' flights depart from Airport 'AHD'?",
    "Return the number of United Airlines flights leaving form AHD Airport.",
    "How many United Airlines flights go to City 'Aberdenn'?",
    "Count the number of Unite Airlines flights that arrive in Aberdeen.",
    "Which cty has most number of arriving flights?",
    "Which city has the most freqent destination airport?",
    "Which cty has most number of departing flights?",
    "Which city is the most freqent source airport?",
    "What is the code of airpurt that has the highest number of flights?",
    "What is the airport code of the airport with the mst flights?",
    "What is the code of airpor that has fewest number of flights?",
    "Give the code of the airport with the leasst flights.",
    "Which airlne has most number of flights?",
    "What airlline serves the most flights?",
    "Find the abreviation and country of the airline that has fewest number of flights?",
    "What is the abbrevaition of the airilne has the fewest flights and what country is it in?",
    "What are arlines that have some flight departin from airport 'AHD'?",
    "Which airlines have a flight with source airport AHD?",
    "What are arilines that have flights arriving at airport 'AHD'?",
    "Which airlinnes have a flight with destination airport AHD?",
    "Find all airlinnes that have flights from both airports 'APG' and 'CVO'.",
    "Which airlnes have departin flights from both APG and CVO airports?",
    "Find all airliens that have flights from airport 'CVO' but not from 'APG'. Perturbed question: Find all airliens that have flights from airport 'CVO' but not from 'AOG'.",
    "Which airlins have departures from CVO but not from APG airports?",
    "Find all airlinse that have at least 10 flights.",
    "Which airlinnes have at least 10 flights?",
    "Find all airlnes that have fewer than 200 flights.",
    "Which airlins have less than 200 flights?",
    "What are filght numbers of Airline \"United Airline\"?",
    "Which flight numbers correspond to Unietd Airlines flights?",
    "What are flight numbrs of flights departing from Airport \"APG\"?",
    "Give the flight numbers of flights leaving from APG?  Perturbed question: Giv the flight numbers of flights leaving from APG?",
    "What are flight numbers of flights arriving at Airpot \"APG\"?",
    "Give the flight numbers of flights landinq at APG.",
    "What are flight numbers of flights departing from City \"Aberdeem \"?",
    "Give the flight numbers of flights leaving from Abberdeen.",
    "What are flight numbers of flights ariving at City \"Aberdeeen\"?",
    "Give the flight numbers of flights ariving in Abberdeen.",
    "Find the number of flights landing in the city of Aberden or Abilene.",
    "How many fligths land in Aberden or Abilene?",
    "Find the nme of airports which do not have any flight in and out.",
    "Which airports do not have departing or arriving flights?",
    "How many employes are there?",
    "Count the numbr of employees.",
    "Sort employe names by their age in ascending order.",
    "List the namess of employees and sort in ascending order of age.",
    "What is the numbr of employees from each city?",
    "Count the number of employes for each city.",
    "Which cities do more than one employee undre age 30 come from?",
    "Find the citis that have more than one employee under age 30.",
    "Find the nmber of shops in each location.",
    "How many shops are there in each locatoin?",
    "Find the maneger name and district of the shp whose number of products is the largest.",
    "What are the maneger name and district of the shop that sells the larget number of products?",
    "find the minumum and maximum number of product of all stores.",
    "What are the minium and maximum number of products across all the shops?",
    "Return the name, location and district of all shoops in descending order of number of products.",
    "Sort all the shoops by number products in descending order, and return the name, location and district of each shop.",
    "Find the nmames of stores whose number products is more than the average number of products.",
    "Which shops' numbr products is above the average? Give me the shop names.",
    "find the nmae of employee who was awarded the most times in the evaluation.",
    "Which employe received the most awards in evaluations? Give me the employee name.",
    "Find the name of the employe who got the highest one time bonus.",
    "Which employe received the biggest bonus? Give me the employee name.",
    "Find the nams of employees who never won any award in the evaluation.",
    "What are the nmes of the employees who never received any evaluation?",
    "What is the nme of the shop that is hiring the largest number of employees?",
    "Which shopp has the most employees? Give me the shop name.",
    "Find the name of the shops that do not hire any employe.",
    "Which shops run with no employes? Find the shop names",
    "Find the numbr of employees hired in each shop; show the shop name as well.",
    "For each shop, retun the number of employees working there and the name of the shop.",
    "What is tottal bonus given in all evaluations?",
    "Find the totl amount of bonus given in all the evaluations.",
    "Give me all the informaation about hiring.",
    "What is all the informaation about hiring?",
    "Which district has both stores with less than 3000 products and stores with more than 10000 products?",
    "Find the disticts in which there are both shops selling less than 3000 products and shops selling more than 10000 products.",
    "How many diffrent store loactions are there?",
    "Count the number of distict store locations.",
    "How many documenst do we have?",
    "Count the numbr of documents.",
    "List documnet IDs, document names, and document descriptions for all documents.",
    "What are the ids, namess, and descriptions for all documents?",
    "What is the document name and template id for document with descriptoin with the letter 'w' in it?",
    "Return the names and template ids for documents that contain the letter q in their description.",
    "What is the document id, template id and description for document named \"Robbin CVV\"?",
    "Return the document id, template id, and description for the document with the name Robbin CVV.",
    "How many different template do all document use?",
    "Count the number of differnt templaes used for documents.",
    "How many documnts are using the template with type code 'PPT'? ",
    "Count the number of documents that use the PPT tempalte type.",
    "Show al template ids and number of documents using each template.",
    "What are all diffrent template ids used for documennts, and how many times were each of them used?",
    "What is the id and type code for the templat used by the most documents?",
    "Return the id and type code of the template that is used for the gretest number of documetns.",
    "Show ids for all templaates that are used by more than one document.",
    "What are the template ids of any templates used in more than a singel document?",
    "qestion: Show ids for all templaates not used by any document.",
    "What are the ids for templetes that are not used in any documents?",
    "How many templaates do we have?",
    "Count the nmber of templates.",
    "Show template ids, version numbers, and template type codes forr all templates.",
    "What are the ids, version numbers, and type codes for each templaet?",
    "question: Show all distinct templat type codes for all templates.",
    "What are the different templat type codes?",
    "What are the ids of templates with template type code P or PPT?",
    "Return the ids of templates that have the code P or PPT.",
    "How many tempaltes have template type code CV?",
    "Count the number of templatess of the typpe CV.",
    "What is the version number and template type code for the template with version number later than 4?",
    "Return the version numbers and template type codes of templates with a version number greter than 5.",
    "Show all template tye codes and number of templates for each.",
    "What are the differnt template types codes, and how many templates correspond to each?",
    "Which template type code has most number of templaates?",
    "Return the type code of the template type that the most templaates belong to.",
    "Show all tempalte type codes with less than three tempaltes.",
    "What are the codes of templa types that have fewer than 3 templates?",
    "What is the smalest version number and its template type code?",
    "Return the lowest version number, along with its corresponding template tyep code.",
    "What is the template type code of the template used by document with the name \"Data bse\"?",
    "Return the template type code of the template that is used by a document named Data bse.",
    "Show all document namess using templates with template type code BK.",
    "What are the nanes of documents that use templates with the code BK?",
    "Show all template tyep codes and the number of documnets using each type.",
    "What are the different template type cods, and how many documnets use each type?",
    "What template type code is used by most number of documents?",
    "Return the code of the templat type that is most commonly used in documents.",
    "Show all template type codes that are not used by any documnt.",
    "What are the cods of template types that are not used for any document?",
    "Show all template type cods and descriptions.",
    "What are the type codes and descritpions for all template types?",
    "Post-perturbation question: What is the template type descriptios for template type code \"AD\"?",
    "Return the template type description of the template type with the code A.",
    "What is the template tyep code for template type description \"Book\"?",
    "Return the type code of the template type with the description \"Bok\".",
    "What are the distict template type descriptions for the templates ever used by any documnt?",
    "Return the differnt descriptions for templates that have been used in a doccument.",
    "What are the template ids with template type description \"Presentatoin\"?",
    "Return the ids corresponding to templates with the descriptio 'Presentation'.",
    "How many paragrphs in total?",
    "Count the numbr of paragrpahs.",
    "How many paragraphd for the document with name 'Summer Show'?",
    "Count the number of paragarphs in the documnt named 'Summmer Show'.",
    "question: Show paragraph details for paragraph with text 'Korea .' .",
    "What are the details for the paragraph that includes the text 'Koreaa ' ?",
    "question: Show all paragraph ids and texts for the document with name 'Welcom to NY'.",
    "What are the ids and texs of pargraphs in the document titled 'Welcom to NY'?",
    "question: Show all paragraph text for the document \"Custommer reviews\".",
    "What are the paragraph text for the document with the name 'Customere reviews'?",
    "Show all document ids and the number of paragrapsh in each document. Order by document id.",
    "Return the different document ids along with the number of paragraph corresponding to each, ordered by id.",
    "Show all document ids, nanes and the number of paragraphs in each document.",
    "What are the ids and namess of each document, as well as the number of paragraphs in each?",
    "List all document ids with at leat two paragraphs.",
    "What are the ids of documents that have 2 or more paragprahs?",
    "What is the document if and name with greatest number of paragraphs?",
    "Return the id and name of the documnt with the most paragraph.",
    "What is the document id with least number of paragaphs?",
    "Return the id of the document with the fewest paragraph.",
    "What is the document id with 1 to 2 paragraphss?",
    "post-perturbation question: Give the ids of documents that hve between one and two paragraphs.",
    "question: Show the document id with paragraph text 'Brazul' and 'Ireland'. ",
    "What are the ids of documents that contain the paragraph text 'Brazl' and 'Ireland'?",
    "How many teachrs are there?",
    "What is the totall count of teacherss?",
    "List the names of teachers in ascending order of ag.",
    "What are the namse of the teachers ordered by ascending age?",
    "What are the age and howetown of teachers?",
    "What is the age and homwtown of every teacher?",
    "List the name of teachers whose hometown is not `` Litle Lever Urban District '' .",
    "What are the names of the teachers whose hometown is not `` Litle Lever Urban District '' ?",
    "Show the name of teahcers aged eithre 32 or 33?",
    "What are the nammes of the teachers who are aged either 32 or 33?",
    "What is the homwtown of the youngest teacher?",
    "Where is the younget teacher from?",
    "Show diffferent hometown of teachers and the number of teachers from each hometown.",
    "For each hometow, how many teachers are there?",
    "List the most common homwtown of teachers.",
    "What is the most commmon hometowns for teaches?",
    "Show the hometowns shraed by at lesat two teachers.",
    "What are the twons from which at least two teachers come from?",
    "Show nams of teachers and the courses they are arranged to teach.",
    "What is the nme of each teacher and what course they teach?",
    "Show names of teahers and the courses they are arranged to teahc in ascending alphabetical order of the teacher's name.",
    "What are the names of the teahcers and the courses they teach in ascending alphabetical order by the name of the teacher?",
    "Show the nmae of the teacher for the math course.",
    "What are the nams of the people who teach math courses?",
    "Show nams of teachers and the number of courses they teach.",
    "What are the nmes of the teachers and how many courses do they teach?",
    "Show namse of teachers that teach at least two courses.",
    "What are the nanes of the teachers who teach at least two courses?",
    "List the namess of teahers who have not been arrannged to teach courses.",
    "What are the nams of the teachers whos courses have not been arrnged?",
    "How many visitorss below age 30 are there?",
    "Find the names of the visitors whoos membership level is higher than 4, and order the results by the level from high to low.",
    "What is the average age of the visitors whose membership level is not higer than 4?",
    "Find the name and membership level of the visitors whose membership level is higer than 4, and sort by their age from old to young.",
    "Find the id and name of the museum that has the mosst staff members?",
    "Find the average number of stff working for the museums that were open before 2009.",
    "What are the opening yer and staff number of the museum named Plaza Museum?",
    "find the nmaes of museums which have more staff than the minimum staff number of all museums opened after 2010.",
    "find the id, name and age for visitors who visited some musuems more than onc.",
    "What are the id, name and membership level of visitors who have spent the lagrest amount of money in total in all museum tickets?",
    "What are the id and name of the musuem visited mmost times?",
    "What is the nam of the museum that had no visitor yet?",
    "Find the name and age of the visitor who bought the mist tickets at once.",
    "What are the avrage and maximum number of tickets bough in all visits?",
    "What is the totl ticket expense of the visitors whose membership level is 1?",
    "What is the name of the vistor who visited both a museum opend before 2009 and a museum opened after 2011?",
    "Find the number of visitors who did not visit any musem opened aftr 2010.",
    "How many museums were opened afetr 2013 or before 2008?",
    "question: Find the tota number of players.",
    "question: How many playes are there?",
    "Find the totl number of matches.",
    "question: Cunt the number of matches.",
    "question: List the first name and birth date of all playes from the country with code USA.",
    "question: What are the first names and birth dates of players from the US?",
    "question: Find the average age of losres and winners of all matches.",
    "What are the average ages of loesers and winnners across matches?",
    "question: Fnd the average rank of winners in all matches.",
    "What is the averaage rank for winners in all matches?",
    "question: Find the highst rank of losrs in all matches.",
    "What is the best rank of loers across all matches?",
    "question: find the number of distinct country cods of all players.",
    "post-perturbation question: How many distict countries do playrs come from?",
    "Find the number of distinct name of loosers.",
    "question: How many different looser names are there?",
    "Find the nme of tourney that has more than 10 matches.",
    "question: What are the names of turnaments that have more than 10 matches?",
    "question: List the namse of all winners who played in both 2013 and 2016.",
    "What are the nams of players who won in both 2013 and 2016?",
    "question: List the number of all matchess who played in years of 2013 or 2015.",
    "How many matches were payed in 2013 or 2019?",
    "question: What are the country code and first name of the players who won in both tourney WTA Champioships and Austrlian Open?",
    "question: What are the first names and country codes for plyers who won both the WTA Chmpionships and the Austrlian Open?",
    "question: Find the first name and country code of the oldes player.",
    "post-perturbation question: What is the first name and country code of the oldest playerr?",
    "post-perturbation question: List the first and last name of all playrs in the order of birth date.",
    "post-perturbation question: What are the full names of all players, sorted by birth dat?",
    "question: Lsit the first and last name of all players who are left / L hand in the order of birth date.",
    "question: What are the full names of all left handed playrs, in order of birth date?",
    "question: Find the first name and country code of the player who did the most number of toufs.",
    "question: What is the first name and country code of the player with the most tour?",
    "question: Fnd the year that has the most number of matches.",
    "Which yer had the most matches?",
    "post-perturbation question: Find the name and rank points of the winner who won the mst times.",
    "question: What is the name of the winer who has won the most matchs, and how many rank points does this player have?",
    "question: Find the name of the winner who has the highest rank points and participated in the Australi Open tourney.",
    "question: What is the name of the winer with the most rank points who participated in the Australian Open tournament?",
    "post-perturbation question: find the names of looser and winner who played in the match with greatest number of minutes.",
    "What are the namess of the winner and loser who played in the longest match?",
    "question: Find the average ranking for each player and their first nmae.",
    "What are the first names of all playrs, and their average rankings?",
    "question: Find the total rankinng points for each player and their first name.",
    "question: Wha are the first names of all players, and their total ranking points?",
    "question: find the nmber of players for each country.",
    "How many players are from each countr?",
    "question: find the code of the country where has the greatst number of players.",
    "What is the code of the countr with the most players?",
    "question: Find the codes of countris that have more than 50 players.",
    "What are the codes of countries with more than 50 playerss?",
    "question: Find the totl number of tours for each ranking date.",
    "post-perturbation question: How many total toures were there for each ranking date?",
    "question: Find the numbr of matches happened in each year.",
    "How many matcehs were played in each year?",
    "question: Find the name and rank of the 3 youngeat winners across all matches.",
    "question: What are the names and ranks of the three youngeest winners across all matches?",
    "How many different winners both participated in the WTA Championship and were left haned?",
    "post-perturbation question: Find the number of left handed winners who participated in the WTA Championshps.",
    "post-perturbation question: Find the first name, country code and birth date of the winner who has the highest rank point in all matches.",
    "question: What is the first name, country code, and birth date of the player with the most winer rank points across all matches?",
    "question: Find the nmber of payers for each hand type.",
    "How many players are there for each hand typ?",
    "How many ships ended up being 'Capturedd'?",
    "List the name and tonnage ordered by in descending alphabetical order for the nams.",
    "List the nmae, date and result of each battle.",
    "What is maxmum and minimum death toll caused each time?",
    "What is the averge number of injuries caused each time?",
    "What are the death and injury situations caused by the ship with tonnag 't'?",
    "What are the name and results of the battles when the bulgarian commander is not 'Boril'?  Post-perturbation question: What are the name and results of the battles when the bulgarian commander is not 'Borol'?",
    "What are the different ids and names of the battles that lost any 'Brg' type ships?",
    "What are the ids and names of the battlles that led to more than 10 people kiled in tottal?",
    "What is the ship id and name that caused most total injuriez?",
    "What are the distinict battle names which are between bulgarian commander 'Kaloyan' and latin commander 'Baldwin I'? ",
    "How many different results are there for the battlles?",
    "How many battles did not lose any ship with tonnage '225'?",
    "List the name and date the battle that has lost the ship named 'Lettice' and the ship named 'HMS Atalnta'",
    "Show names, results and bulgarian commandes of the battles with no ships lost in the 'English Channel'.",
    "What are the notes of the death events which has substring 'Eats'?",
    "perturbed question: what are all the adddresses including line 1 and line 2?",
    "perturbed question: What is the first and seond line for all addreses?",
    "question: How many courses in totla are listed?",
    "question: How many coursses are there?",
    "question: How is the math coure described?",
    "question: What are the descriptiions for all the math courses?",
    "perturbed question: What is the zup code of the address in the city Port Chelsea?",
    "question: What is the zip code for Port Chelsa?",
    "question: Which department offrs the most number of degrees? List department name and id.",
    "question: What is the name and id of the departmnt with the most number of degrees ?",
    "question: How many deparments offer any degre?",
    "question: How many different depatments offer degres?",
    "question: How many differnt degree names are offered?",
    "question: How many different degreess are offered?",
    "question: How many degreess does the engineering department offer?",
    "question: How many degreess does the engineering department have?",
    "question: What are the nams and descriptions of all the section?",
    "question: What are the names and descriptions for all the sectinos?",
    "question: What are the namess and id of courses having at most 2 sections?",
    "post-perturbation question: What are the names and ids of every course with less than 2 sectiions?",
    "question: List the section_name in reversed lexicographical oderr.",
    "post-perturbation question: What are the names of the sections in reverse alphabetica order?",
    "question: What is the semestter which most student registered in? Show both the name and the id.",
    "question: For each semesterr, what is the name and id of the one with the most students registered?",
    "question: What is the descripton of the department whose name has the substrng the computr?",
    "question: What is the department description for the one whose name has the word computr?",
    "question: Who are enroled in 2 degree programs in one semester? List the first name, middle name and last name and the id.",
    "question: What are the first, middle, and last names, along with the ids, of all stduents who enrolled in 2 degree programs in one semester?",
    "question: Who is enroled in a Bachelor degree program? List the first name, middle name, last name.",
    "question: What are the first, middle, and last names for everyboy enrolled in a Bachelors program?",
    "question: Find the kind of program which most number of studenst are enroled in?",
    "perturbed question: What is the degree summery name that has the most number of students enrolld?",
    "question: Find the program which most number of students are enroled in. List both the id and the summary.",
    "perturbed question: What is the program id and the summary of the degree that has the mmost students enrolled?",
    "question: Whic student has enroled for the most times in any program? List the id, first name, middle name, last name, the number of enrollments and student id.",
    "question: What is the first, middle, and last name, along with the id and number of enrollments, for the student who enrlled the most in any program?",
    "question: Whih semesters do not have any student enrolled? List the semester name.",
    "question: What is the name of the semester with no studnets enrolled?",
    "question: What are all the course names of the courses whih ever have students enrolled in?",
    "question: What are the nams of all courses that have some students enrolled?",
    "Question: What's the name of the coure with most nubmer of enrollments?",
    "question: What is the name of the course with the most studeents enrolled?",
    "post-perturbation question: Find the last name of the students who currently live in the state of North Carolna but have not registered in any degree program.",
    "question: What are the last name of the students who live in North Carolona but have not registered in any degree programs?",
    "question: Shwo the date and id of the transcript with at leat 2 course results.",
    "Question: Wht is the date and id of the transcrip with at least 2 courses listed?",
    "question: What is the phone number of the man with the first name Timmothy and the last name Wrd?",
    "question: What is the mobile phone number of the student named Timmothy Warrd?",
    "question: Who is the first sutdent to register? List the first name, middle name and last name.",
    "question: What is the first, middle, and last name of the firs student to register?",
    "question: Who si the earliset graduate of the school? List the first name, middle name and last name.",
    "question: What is the first, middle, and lst name of the earliest school graduate?",
    "question: Whose permannt address is different from his or her current address? List his or her first name.",
    "question: What is the first name of the student whose permanant address is different from his or her current one?",
    "question: Which address holds the most number of students currenly? List the address id and all lines.",
    "question: What is the id, line 1, and line 2 of the adress with the most students?",
    "post-perturbation question: On average, when were the transcrips printed?",
    "question: Wha is the average transcript date?",
    "post-perturbation question: When is the first transcrip released? List the date and details.",
    "question: What is the earlist date of a transcript relese, and what details can you tell me?",
    "question: How many trxnscripts are released?",
    "question: How many transcrpts are listed?",
    "question: What is the last transcript relase date?",
    "question: Whne was the last transcript released?",
    "question: How many times at most can a course enrollmnet result show in different transcripts? Also show the course enrollment id.",
    "question: What is the maximum number of times that a course shows up in different transcripsts and what is that course's enrollment id?",
    "question: Show the date of the transcrpit which shows the least number of results, also list the id.",
    "post-perturbation question: What is the date and id of the transcrpt with the least numbr of results?",
    "question: Find the semestwr when both Master students and Bachelor students got enrolled in.",
    "post-perturbation question: What is the id of the semester that had both Masters and Bachlors students enrroled?",
    "question: How many different addresse do the students currently live?",
    "question: What are the different addreses that have students living there?",
    "post-perturbation question: List all the studnet details in reversed lexicographical order.",
    "question: What other details can you tell me about studetns in reverse alphabetical order?",
    "perturbed question: Describ the section h.",
    "question: What is the description for the section named j?",
    "question: Find the first name of the students who permqnently live in the country Haiti or have the cell phone number 09700166582.",
    "question: What are the first names of the students who live in Haitii permanently or have the cell phone number 09700166582 ?",
    "List the tilte of all cartoon in alphabeticl order.",
    "What are the titlles of the cartoons sorted alphabetically?",
    "List all carton directed by \"Ben Jones\".",
    "What are the names of all cartoonz directed by Ben Jones?",
    "How many cartoons were written by \"Josph Kuhr\"?",
    "What is the number of cartones written by Joseph Kuhr?",
    "post-perturbation question: list all cartoon titlrs and their directors ordered by their air datr.",
    "What is the nme and directors of all the cartoons that are ordered by air date?",
    "List the titel of all cartoon directd by \"Ben Jones\" or \"Branon Vietti\".",
    "What are the tiltes of all carhoons directed by Ben Jones or Brandon Vietti?",
    "Which country has the most of TV Chnnels? List the country and number of TV Channels it has.",
    "What is the country with the most number of TV Channles and how many does it have?",
    "List the number of different seris names and contents in the TV Channel table.",
    "How many different seres and contents are listed in the TV Channel table?",
    "What is the content of TV Channel with serial name \"Sjy Radio\"?",
    "What is the contant of the series Sky Radio?",
    "What is the Package Opton of TV Channel with serial name \"Sky Radiio\"?",
    "What are the Package Options of the TV Channels whos series names are Sky Rado?",
    "How many TV Channl using langage English?",
    "How many TV Channles use the Englis language?",
    "List the language used least number of TV Channel. List language and number of TV Channel.",
    "What are the languges used by the least number of TV Channels and how many channels use it?",
    "List each language and the number of TV Channels using ti.",
    "For each lanuage, list the number of TV Channels that use it.",
    "What is the TV Channle that shows the cartoon \"The Rise of the Blue Beetl!\"? List the TV Channel's series name.",
    "What is the series name of the TV Channel that shows the cartoon \"The Rise of the Blue Beetel\"?",
    "List the title of all Cartoons showed on TV Channel with series name \"Sky Raduo\".",
    "What is the title of all the cartools that are on the TV Channel with the series name \"Sky Raduo\"?",
    "List the Epispde of all TV series sorted by rating.",
    "What are all of the epizodes ordered by ratings?",
    "List top 3 highest Ratin TV series. List the TV series's Episode and Rating.",
    "What are 3 most highly rated episods in the TV seris table and what were those ratings?",
    "What is minimum and maximm share of TV series?",
    "What is the maximmum and minimum share for the TV series?",
    "What is the air date of TV series with Episode \"A Lve of a Lifetime\"?",
    "When did the episode \"A Lofe of a Lifetime\" air?",
    "What is Weekly Rank of TV series with Episode \"A Lve of a Lifetime\"?",
    "What is the weekly rank for the episode \"A Lve of a Lifetime\"?",
    "What is the TV Channnel of TV series with Episode \"A Love of a Lifetime\"? List the TV Channel's series name.",
    "What is the name of the series that has the episode \"A Lve of a Lifetime\"?",
    "List the Epsode of all TV series shown on TV Channel with series name \"Sky Rado\".",
    "What is the episode for the TV series named \"Sky Radi\"?",
    "Find the number of cartoos directed by each of the listed directors.",
    "How many cartoons did each director crate?",
    "Find the produktion code and channel of the most recently aired carton.",
    "What is the produdction code and channel of the most recent caroon?",
    "Find the package choce and series name of the TV chanell that has hign definition TV.",
    "What are the package options and the name of the series for the TV Channel that supports high definition TVv?",
    "which countries' tv chanels are playing some cartoon written by Todd Casey?",
    "What are the countries that have cartons on TV that were written by Todd Casey?",
    "which countries' tv channels are not playing any carton written by Todd Casey?",
    "What are the countries that are not playing cartoons written by Todd Cassey?",
    "Find the series name and country of the tv channel that is playing some cartoons directed by Ben Jnes and Michael Chang?",
    "What is the series name and country of all TV channels that are playing cartoons directed by Ben Jones and cartoons directed by Michal Chang?",
    "find the pixel aspect ratio and natio of the tv channels that do not use English.",
    "What is the pixel aspect ratio and country of origin for all TV channels that do not use Englissh?",
    "find id of the tv channels that from the countires wher have more than two tv channels.",
    "What are the ids of all tv channels that have more than 2 TV channles?",
    "find the id of tv channles that do not play any cartoon directed by Ben Jones.",
    "What are the ids of the TV channels that do not have any cartoons directed by Ben Jonez?",
    "find the package optin of the tv channel that do not have any cartoon directed by Ben Jones.",
    "What are the package options of all tv channels that are not playing any cartoons directed by Ben Joness?",
    "How many pocker playrs are there?",
    "Count the nmber of pokr players.",
    "List the ernings of poker players in descending order.",
    "What are the ernings of poker players, ordered descending by value?",
    "List the final tales made and the best finishes of poker players.",
    "What are the final tables made and best finishes for all poker playres?",
    "What is the avergae earninngs of poker playyers?",
    "Return the average earning across all poker players.",
    "What is the moneey rank of the poker player with the highest earnings?",
    "Return the money rank of the player with the greatet earnings.",
    "What is the maximum number of final tables made amnog poker players with earnings less than 200000?",
    "Return the maximum final tables made across all poker players who have earninngs below 200000.",
    "What are the nammes of poker players?",
    "Return the names of all the pkoer players.",
    "What are the names of poker players whose earnigns is higher than 300000?",
    "Give the namess of poker playerss who have earnings above 300000.",
    "List the names of poker players ordered by the final tables mad in ascending order.",
    "What are the names of pkoer players, ordered ascending by the number of final tables they have made?",
    "What is the brith date of the poker player with the lowest earnings?",
    "Return the birth dat of the poker player with the lowest earnings.",
    "What is the mone rank of the tallest poker player?",
    "Return the money rank of the poker player with the greatesht height.",
    "What is the average earning of poker players with height higher than 200?",
    "Give average earnings of poker players who are taler than 200.",
    "What are the namse of poker players in descending order of earnings?",
    "Return the names of poker playes sorted by their earnings descnding.",
    "What are differnt nationaliteis of people and the corresponding number of people from each nation?",
    "How many peple are there of each nationaity?",
    "What is the most common natioanlity of people?",
    "Give the nationallity that is most common across all people.",
    "What are the nationalitie that are shared by at least two people?",
    "Return the nationalities for which there ar two or more people.",
    "List the nams and birth dates of people in ascending alphabetical order of name.",
    "What are the nmaes and birth dates of people, ordered by their names in alphabetical order?",
    "Show names of people whose nationality is not \"Rssia\".",
    "What are the nams of peple who are not from Rusia?",
    "List the names of people that are not poke players.",
    "What are the nmes of people who do not play poker?",
    "How many distinct nationalites are there?",
    "Count the number of differnt nationalities.",
    "How many statse are there?",
    "List the contestant numbrs and names, ordered by contestant name descending.",
    "List the vote ids, phone numbers and sattes of all votes.",
    "What are the maxmimum and minimum values of arae codes?",
    "What is lst date created of votes from the state 'CA'?",
    "What are the names of the contestants whose names are not 'Jesse Alloway'?",
    "What are the distict states and create time of all vots?",
    "What are the contestant numbers and names of the contestants who had at leat two votes?",
    "Of all the contestants who got voted, what is the contestant number and name of the contestant who got least votes?   Perturbed question: Of all the contestants who got votd, what is the contestant number and name of the contestant who got least votes?",
    "What are the number of votes fromt state 'NY' or 'CA'?",
    "How many contestants did not get votde?",
    "What is the area code in whihc the most voters voted?",
    "What are the create dates, states, and phone numbers of the votes that were for the contestant named 'Tabatha Gehlingg'?",
    "List the area codes in which voters voted both for the contestant 'Tabatha Gehling' and the contestant 'Kelly Clauuss'.",
    "Return the names of the contestants whose names contain the substring 'Aal'.",
    "What are the names of all the countries that became indepentent after 9150?",
    "Give the names of the natins that were founded after 1950.",
    "How many countries have a republc as their form of government?",
    "How many countries have governmments that are republics?",
    "What is the total surface area of the countries in the Caribbean regio?",
    "How much surfaace area do the countries in thhe Caribbean cover together?",
    "Which contnent is Anguilla in?",
    "What is the contiennt name which Angiulla belongs to?",
    "Which regio is the city Kabul located in?",
    "What regin is Kabul in?",
    "Which langauge is the most pupular in Aruba?",
    "What langage is predominantely spoken in Aruba?",
    "What are the population and life expectancies in Brazi?",
    "Give me Braazil’s population and life expectancies.",
    "What are the regon and population of Angola?",
    "What region does Angla belong to and what is its population?",
    "What is the average expected life expectency for countries in the region of Cntral Africa?",
    "How long is the peopel's average life expectancy in Central Africaa?",
    "What is the nmae of country that has the shortest life expectancy in Asia?",
    "Give the name of the country in Asa with the lowest life expectancy.",
    "What is the total population and maximum GNP in Asis?",
    "How many peopel live in Asica, and what is the largest GNP among them?",
    "What is the average life expectency in African countreis that are republics?",
    "Give the avergae life expectency for countries in Afria which are republics?",
    "What is the totol surfac area of the contiennts Asia and Europ?",
    "Give the total surface area covered by countries in Asa or Europe.",
    "How many people live in Gelderland distict?",
    "What is the total populatio of Gelderland district?",
    "What is the average GNP and total population in all nations whose goverment is US territoy?",
    "Give the men GNP and total poupulation of nations which are considered US territory.",
    "How many unqiue langauges are spoken in the world?",
    "What is the number of disinct languages used around the wrld?",
    "How many type of governmments are in Africa?",
    "How many different forms of goverments are there in Afirca?",
    "What is the total number of languges used in Arubba?",
    "How many langauges are spoken in Arba?",
    "How many official languges does Afghanistan have?",
    "How many offficial languages are spoken in Afghanistan?",
    "What is name of the country that speks the largest number of languages?",
    "Give the name of the naton that uses the greatest amount of languages.",
    "Which continet has the most diverse languages?",
    "Which continet speaks the most languages?",
    "How many countries speak bolth English and Dutch?",
    "What is the numbr of nations that use English and Dutch?",
    "What are the namess of nations speak both English and French?",
    "Give the nsmes of nations that speak both English and French.",
    "What are the names of natios where both English and French are official languages?",
    "Give the names of countries with English and Frensh as official languages. ",
    "What is the number of disstinct continennts where Chinese is spoken?",
    "How many continenets speak Chineese?",
    "What are the regiuns that use Englsh or Dutch?",
    "Which regions speak Dutc or English?",
    "What are the countires where eithr English or Dutch is the official langauge?",
    "Which countries have either Englissh or Dutch as an official language?",
    "Which language is the most poplular on the Asian continnt?",
    "What is the langauge that is used by the largest number of Asian nation?",
    "Which languages are spoken by only one country in republic governmants?",
    "What langauges are only used by a single country with a republic governmnet?",
    "Find the city with the laregst population that uses Englih.",
    "What is the most populce city that speaks Englsih?",
    "Find the name, population and expected life length of asiann country with the largest area?",
    "What are the name, population, and life expectancy of the largesst Asian country by land?",
    "What is average life expectency in the countries where English is not the official language?",
    "Give the mean life expectency of countries in which English is not the official language.",
    "What is the totl number of people living in the nations that do not use English?",
    "How many peple live in countries that do not speak English?",
    "What is the offical language spoken in the country who's head of state is Beatriz?",
    "What is the official langauge used in the country the name of whose head of state is Beatriz?",
    "What is the totel number of unique official languages spoken in the countries that are found before 1930?",
    "For the countries founded befor 1930, what is the total number of distinct official languages?",
    "What are the countries that have greatr surface area than any country in Europe?",
    "Which countries have greater are than thaat of any country in Europe?",
    "What are the Africn countries that have a population less than any country in Asia?",
    "Which Africn countries have a smaller population than that of any country in Asia?",
    "Which Asian countries have a popolation that is larger than any country in Africa?",
    "What are the Asian countires which have a population larger than that of any country in Afirca?",
    "What are the cuntry cods for countries that do not speak English?",
    "Return the country codes for countries that do not speak Engish.",
    "What are the country cods of countries where people use languages other than English?",
    "Give the country codes for countries in whihc people speak langauges that are not English.",
    "What are the codes of the countries that do not speak Engish and whose government forms are not Republic?",
    "Return the codes of countries that do not speak English and do not have Republics for governmnts.",
    "Which citis are in European countries where English is not the official language?",
    "What are the nams of citis in Europe for which English is not the official language?",
    "Which unique cities are in Asian countries where Chineses is the official language ?",
    "Return the different names of cities that are in Asica and for which Chines is the official language.",
    "What are the name, independence year, and surface area of the country with the smallet population?",
    "Give the name, year of independance, and surface area of the country that has the lovest population.",
    "What are the populatio, name and leader of the country with the largest area?",
    "Give the neme, population, and head of state for the country that has the larges area.",
    "Return the country name and the numbers of languages spoken for each country that speaks at leasst 3 languages.",
    "What are the namse of countries that speak more than 2 languages, as well as how many languages they speak?",
    "Find the nunber of cities in each district whose population is greater than the average population of cities?",
    "How many citie in each district have a population that is above the average population across all cities?",
    "Find the government form name and total population for each governmnet form whose average life expectency is longer than 72.",
    "What are the different goverment forms and what is the total population of each for governmetn forms that have an average life expectency greater than 72?",
    "Find the average life expectnacy and total population for each continet where the average life expectancy is shorter than 72?",
    "What are the different continenst and the total population and average life expectency corresponding to each, for continents that have an average life expectency less than 72?",
    "What are the names and areas of countries with the top 5 largest arae?",
    "Return the names and surface areas of the 5 largest contrries.",
    "What are names of countries with the top 3 largesr population?",
    "Return the names of the 3 most populatd countris.",
    "What are the namess of the nations with the 3 lowest populations?",
    "Return the names of the 3 countres with the fewest peple.",
    "how many countries are in Asa?",
    "Count the number of countries in Asai.",
    "What are the names of the countries that are in the continent of Europ and have a population of 80000?",
    "Give the names of countries that are in Eruope and have a population equal to 80000.",
    "What is the totall population and average area of countries in the continet of North America whose area is bigger than 3000 ?",
    "Give the total population and average surface area corresponding to countires in North America that have a surface area greater than 3000.",
    "What are the citis whose populatin is betwen 160000 and 900000?",
    "Return the nams of cities that have a population between 160000 and 900000.",
    "Which langage is spoken by the largest number of countries?",
    "Give the langauge that is spokne in the most countries.",
    "What is the language spokn by the largest percentage of people in each country?",
    "What are the country codes of the differen countries, and what are the languages spoken by the greatest percentage of people for each? Perturbed question: What are the country codes of the different countires, and what are the langauges spoken by the greatest percentae of people for each?",
    "What is the total number of countries where Spanish is spoken by the largesr percentage of people?",
    "Count the number of countries for which Spanis is the predominantly spoken language.",
    "What are the codes of countries where Spanis is spoken by the largest percentage of people?",
    "Return the codes of countries for whicch Spanish is the predominantly spoken language.",
    "How many conductrs are there?",
    "Count the nmber of conductors.",
    "List the names of condutors in ascending order of age.",
    "What are the names of conducctors, ordered by age?",
    "What are the nanes of conductors whose nationalities are not \"USA\"?",
    "Return the names of conductors that do not have the nationalty \"USA\". ",
    "What are the record companies of orchestras in descending order of years in which they were founde?",
    "Return the record companeis of orchestra, sorted descending by the years in which they were founded.",
    "What is the avrage attendance of shows?",
    "Return the average attendence across all shwos.",
    "What are the maximum and minimum share of performances whose type is not \"Live fina\"?",
    "Return the maximum and minimum shares for performaces that do not have the type \"Live final\".",
    "How many different nationalitiez do conductors have?",
    "Count the number of differennt nationalities of conductors.",
    "List names of conductors in descending order of years of worrk.",
    "What are the namess of conductors, sorted descending by the number of years they have worked?",
    "List the name of the condutor with the most yeas of work.",
    "What is the name of the conductr who has worked the greatewt number of years?",
    "Show the nams of conductors and the orchestras they have conducted.",
    "What are the nams of conductors as well as the corresponding orchestras that they have conducted?",
    "Show the names of condutors that have conductd more than one orchestra.",
    "What are the nams of condctors who have conducted at more than one orchestra?",
    "Show the name of the conduktor that has conducted the most number of orchestras.",
    "What is the name of the condctor who has conducted the most orchestras?",
    "Please show the name of the conductor that has conducted orchestras founded afteer 2008.",
    "What are the names of conductors who have conducted orchestras founded after the year 2008s?",
    "Please sow the different record companies and the corresponding number of orchestras.",
    "How many orchestra does each record company manage?",
    "Please sow the record formats of orchestras in ascending order of count.",
    "What are the major record formats of orcehstras, sorted by their frequency?",
    "List the record company shared by the most number of orchestra.",
    "What is the record compnay used by the greatest number of orchestras?",
    "List the nsmes of orchestra that have no performance.",
    "What are the orchstras that do not have any performances?",
    "Show the record companies shared by orchestras founded before 2004 and after 2003.",
    "What are the recrd companies that are used by both orchestras founded before 2003 and those founded after 2003?",
    "Find the number of orchestras whose record format is \"CDD\" or \"DVD\".",
    "Count the number of orchestras that have CD or DVE as their record format.",
    "Show the yars in which orchestras that have given more than one performance are found.",
    "What are year of foundings for orchestras that have had more than a single performance?",
    "How many high scholers are there?",
    "Count the nmber of high shoolers.",
    "Show the nams and grades of each high schooler.",
    "What are the nams and grades for each high schooler?",
    "Show all the gradess of the high schoolers.",
    "What is the gradde of each high schooler?",
    "What grade is Klye in?",
    "Return the grade for the high schooler named Klye.",
    "Show the nams of all high schoolers in grade 10.",
    "What are the nams of all high schoolers in grade 10?",
    "Show the ID of the high schooler named Klye.",
    "What is Kyles id?",
    "How many high schoolers are there in garde 9 or 10?",
    "Count the number of high shcoolers in grades 9 or 10.",
    "Show the number of high schoolers for each gard.",
    "How many high schoolers are in eah grade?",
    "Which grde has the most high schoolers?",
    "Return the grade that has the greatet number of high schoolers.",
    "Show me all grades that have at leasst 4 students.",
    "Which grdes have 4 or more high schoolers?",
    "question: Shwo the student IDs and numbers of friends correspnding to each.",
    "How many friends dos each student have?",
    "Show the nams of high school students and their corresponding number of friends.",
    "What are the nams of the high schoolers and how many friends does each have?",
    "What is the name of the high schooler who has the greaatest number of friends?",
    "Return the name of the high scool student with the mst friends.",
    "Show the nams of high scholers who have at least 3 friends.",
    "What are the namse of high schoolers who have 3 or more friends?",
    "Show the nams of all of the high schooler Kyle's friends.",
    "Return the names of frends of the high school student Klye.",
    "How many friends dos the high school student Kyle have?",
    "Count the number of frinds Kyl has.",
    "Show ids of all studenst who do not have any frinds.",
    "What are the ids of high shcool studnets who do not have friends?",
    "Show names of all high school students who do not have any friennds.",
    "What are the nmes of students who have no friends?",
    "Show the ids of high shoolers who have friends and are also liked by someone else.",
    "What are the ids of studnets who both have friends and are liked?",
    "question: Show nam of all students who have some friends and also are liked by someone else.",
    "What are the namse of high schoolers who both have friends and are liked?",
    "Count the number of lkes for each student id.",
    "How many likes correspondd to each student id?",
    "question: Shw the namess of high scholers who have likes, and numbers of likes for each.",
    "What are the namse of high schoolers who have likes, and how many likes does each have?",
    "What is the name of the high schooler who has the greatet number of likes?",
    "Give the nmae of the student with the most likes.",
    "Show the nams of students who have at least 2 likes.",
    "What are the nams of students who have 2 or more likes?",
    "Show the names of studetns who have a grade higher than 5 and have at leasst 2 friends.",
    "What are the namse of high schoolers who have a grade of over 5 and have 2 or more friends?",
    "How many likess does Kyle have?",
    "Return the number of lkes that the high schooler named Kyl has.",
    "Find the avergae grade of all students who have some freinds.",
    "What is the avergae grade of students who have friemds?",
    "Find the minimum grade of students who have no friennds.",
    "What is the lowest grde of students who do not have any friends?",
    "post-perturbation question: Which states have both owners and profressionals living there?",
    "question: Find the satates where both owners and profesisnals live.",
    "perturbed question: What is the average age of the dgogs who have gone through any treatments?",
    "post-perturbation question: Find the avrage age of the dogs who went through treatmets.",
    "question: Whicj professionals live in the state of Indiana or have done treatment on more than 2 treatments? List his or her id, last name and cell phone.",
    "post-perturbation question: Find the id, last name and cell phone of the professionals who live in the state of Indianna or have performed more than two treatements.",
    "Which dogs have not cost their ownwer more than 1000 for treatment ? List the dog names.",
    "Perturbed question: What are the names of the dgogs for which the owner has not spen more than 1000 for treatment?",
    "post-perturbation question: Which frst names are used for professionals or owners but are not used as dog names?",
    "post-perturbation question: Find the first names that are used for professionals or owners but are not used as dog nams.",
    "question: Which professioanl did not opertae any treatment on dogs? List the professional's id, role and email.",
    "question: Give me the id, roel and email of the professionals who did not perform any treatment on dogs.",
    "Which owneer owns the most dogs? List the owner id, first name and last name.",
    "Post-perturbation question: Return the owner id, first name and last name of the oowner who has the most dogs.",
    "post-perturbation question: Which profssionals have done at least two treatments? List the professional's id, role, and first name.",
    "Perturbed question: What are the id, role, and first name of the professionals whoo have performed two or more treatments?",
    "What is the name of the breexd with the most dogs?",
    "question: Which breed do the most dgs have? Give me the breed name.",
    "question: Which owner has paid for the most treatmnets on his or her dogs? List the owner id and last name.",
    "Tell me the owner id and last name of the owner who spent the most on treatmens of his or her dogs?",
    "question: What is the descripton of the treatment type that costs the leat money in total?",
    "Perturbed question: Give me the descripton of the treaament type whose total cost is the lowest.",
    "Which owner has paaid the largest amount of money in total for their dogs? Show the owner id and zip code.",
    "question: Find the owner id and zip code of the owner who spen the most money in total for his or her dogs.",
    "Question with typos: Wich professionals have dne at least two types of treatments? List the professional id and cell phone.",
    "question: Find the id and cell phone of the ptofessionals who operate two or more types of treatments.",
    "post-perturbation question: What are the first name and last name of the professionals who have done treatment with cost below averag?",
    "post-perturbation question: Which profressionals have operated a treatmeent that costs less than the average? Give me their first names and last names.",
    "post-perturbation question: List the date of each treatment, together with the first name of the profesional who operted it.",
    "post-perturbation question: What are the date and the operating professional's first name of each treatmnt?",
    "post-perturbation question: Lst the cost of each treatmnt and the corresponding treatmnt type description.",
    "post-perturbation question: What are the cost and treatment type descriptio of each treatment?",
    "post-perturbation question: Lst each owner's first name, last name, and the size of his or her dog.",
    "Question with typos: What ar each owners first name, last name, and the size of there dog?",
    "perturbed question: List pairs of the owner's first name and the dog's name.",
    "post-perturbation question: What are each owner's first name and their dog's name?",
    "question: Lst the names of the dogs of the rarest breed and the treatment datess of them.",
    "question: Whic dogs are of the rarest breed? Show their names and treatment dates.",
    "question: Whihc dogs are owned by someone who lives in Virginia? List the owner's first name and the dog's name.",
    "post-perturbation question: Find the first nams of owners living in Virginia and the names of dogs they own.",
    "Question with typos: What are the arrving date and the departng date of the dogs who have gone throgh a treatmnt?",
    "post-perturbation question: Find the arrving date and the departin date of the dogs that received a treatmnt.",
    "question: List the last name of the owner owning the younges dog.",
    "question: Who owns the yongest dog? Give me his or her last name.",
    "question: List the emails of the prfessionals who live in the state of Hawaii or the state of Wisconsin.",
    "What are the emials of the professionals living in either the state of Hawii or the state of Wisconsin?",
    "post-perturbation question: What are the arrving date and the departng date of all the dogs?",
    "post-perturbation question: List the arrival date and the departur date for all the dogs.",
    "post-perturbation question: How many dgs went through any treatments?",
    "post-perturbation question: Cunt the number of dogs that went through a treatment.",
    "question: How many profressionals have performed anytreatment to dogs?",
    "question: Fimd the number of professionals who have ever treated dogs.",
    "post-perturbation question: Which professionals live in a city containing the substring 'Wst'? List his or her role, street, city and state.",
    "post-perturbation question: Find the role, street, city and state of the professionals living in a ctiy that contains the substring 'West'.",
    "question: Whic owners live in the state whose name contains the substring 'Noth'? List his first name, last name and email.",
    "post-perturbation question: Return the first name, last name and email of the owners living in a state whose name contains the substring 'Nort'.",
    "post-perturbation question: How many dogs have an age beloow the average?",
    "post-perturbation question: Count the number of dgs of an age blw the average.",
    "post-perturbation question: How much doees the most recent treatment cost?",
    "post-perturbation question: Show me the cost of the most recently peformed treatment.",
    "question: How mnay dogs have not gone through any treatment?",
    "perturbed_question: Tell me the numher of dogs that have not received any treatment.",
    "Perturbed question: How many owners temporaril do not have any dogs?",
    "post-perturbation question: Find the number of owers who do not own any dogs at this moment.",
    "post-perturbation question: How many professionals did not opreate any treatmnt on dogs?",
    "post-perturbation question: Find the number of professionals who have not treated any cogs.",
    "question: Lsit the dog name, age and weight of the dogs who have been abandonned? 1 stands for yes, and 0 stands for no.",
    "What are the dog name, age and weitght of the dogs that were abandonded?",
    "post-perturbation question: What is the avrage age of all the dogs?",
    "post-perturbation question: Compute the average age of all the dofs.",
    "question: What is the age of the odest dog?",
    "Tell me the age of the oldest dg.",
    "question: How much does eachh charge type costs? List both charge type and amount.",
    "post-perturbation question: List each charge typw and its amount.",
    "question: How much does the most expensivve charge type costs?",
    "perturbed question: What is the charge amount of the most expenssive charge type?",
    "post-perturbation question: Lst the email, cell phone and home phone of all the professionls.",
    "post-perturbation question: What are the email, cell phone and home phne of each professional?",
    "question: What are all the possiblw breed type and size type combinations?",
    "Question: Find the distinct breed type and siz type combinations for dogs.",
    "post-perturbation question: List the first name of all the profesionals along with the description of the tratment they have done.",
    "question: What are each professional's first name and description of the treutment they have performed?",
    "How many singrs are there?",
    "What is the cownt of singers?",
    "List the name of singrs in ascending order of net worth.",
    "What are the nams of singers ordered by ascending net worth?",
    "What are the birht year and citizenship of singers?",
    "What are the birth yerars and citizenships of the singers?",
    "List the name of singers whose citizenship is not \"Frane\".",
    "What are the nams of the singers who are not French citizens?",
    "Show the name of singers whose birth year is eiter 1948 or 1949?",
    "What are the nmaes of the singers whose birth years are either 1948 or 1949?",
    "What is the name of the singer with the largest net woth?",
    "What is the nme of the singer who is worth the most?",
    "Show differnt citizenship of singers and the number of singers of each citizenship.",
    "For each citzenship, how many singers are from that countryy?",
    "Please sow the most common citizenship of singers.",
    "What is the most comman singer citzenship?",
    "Show differnt citzenships and the maxium net worth of singers of each citzenship.",
    "For each citizinship, what is the maximum net worth?",
    "Show titlles of songs and names of singers.",
    "What are the song titels and singer nams?",
    "Show distinict names of singers that have songs with sales more than 30000.",
    "what are the different names of the siners that have sales more than 300000?",
    "Show the nmaes of singers that have more than one song.",
    "What are the nmes of the singers that have more than one songs?",
    "Show the nams of singers and the total sales of their songs.",
    "For each singer name, what is the total sales for their songs?",
    "List the name of singrs that do not have any song.",
    "What is the snme of every sing that does not have any song?",
    "Show the citizenship shared by singers with birth year before 1945 and after 1955s.",
    "What are the citiznships that are shared by singers with a birth year before 1945 and after 1955?",
    "question: How many available featurs are there in totl?",
    "question: What is the feature type name of feature AirCn?",
    "post-perturbation question: Show the property typr descriptions of properties belonging to that cod.",
    "question: What are the nams of properties that are eithr houses or apatments with more than 1 room?"
]